{
    "messages": [
        {
            "author": "Zac",
            "text": "Hey Holleigh I hope you slept well and you finish your assignments before your trip to Georgia :) I’ve been meaning to ask you this for a while, but I’ve been patient due to your past experiences 😬  but I’ll just come out and say it, would you ever consider dating me? I hope this doesn’t sound crazy, but it really feels like the Lord has been giving me signs to shoot my shot. I’ve been praying for months for the Lord find me a woman, and I was initially wanting to talk to you to see if we could be friends, but as I got to know you, you seem to be exactly what I’d imagine when I would pray. I wanted to ask you over text so you could take some time to respond :) Anyways if you want to stay friends, I’ll still watch Chosen and game with you but I just felt the need to say this haha, I hope I’m different than the guys always hitting you up in the DMs.",
            "date": "March 20"
        },
        {
            "author": "Holleigh",
            "text": "Hey Zac!! I slept SO well and I’ve finished almost all my assignments before heading to Georgia tomorrow! Praise the Lord! :D I hope today has been well for you also and you’ve gotten through your assignments!! That does not sound crazy at all, I really appreciate you taking the time to think and ask God and have patience to ask this! I know it’s so scary to communicate that and I’m so proud of you :) I would 100% date you! 😁 I’ve actually been praying and sitting on this for a while and talking to God about it for a while, and this just made my year!! 😁 I would of course want to meet you in person aswell ! But yes, I’d date you ! :D I’m literally sitting here smiling my face off 😂 from the time I’ve gotten to know you Zac you are such an awesome and amazing person, I’m truly thankful God placed you in my life when he did and I’m so glad I said yes to talking to you when you reached out again in January!!  You are 100% different than the creeps DM’ing me 😆 gah this has made my day",
            "date": "March 20"
        },
        {
            "author": "Holleigh",
            "text": "I can finally say this without (maybe) seeming really weird 😂 I love your smile, it lights up my day and just to see it makes my whole world spin around. I love your laugh and your whole personality, I love getting to FaceTime you because I get to see you and it makes my whole entire year. You completely take over my thoughts all the time, I find myself constantly thinking about you. I find myself sometimes just staring and admiring you which I hope doesn’t sound creepy 😆 but how can I not admire Gods beautiful creation. Zac you are truly one of the best people I’ve had the honor of meeting. I talk to myself in my head all the time about how cute and handsome you are, I internally freak out when you send me a snap or we do get to talk face to face and I’m trying to be discreet😂 but yeah, I think you’re really great :) I love everything about you, flaws and all. Our flaws don’t define us, you are such a strong and amazing person and I’m truly honored you’ve chosen me to want to do life with and walk alongside . I thank God everyday for you, I talk to God about you every single day because I just can’t believe you took interest in me and want me. I still have some baggage I need to flesh out and something to tell you because I am serious about this, about us. I’m all in, I was all in from the day you confessed and I’ve been in since before then haha. I know we can and will make this work out, no matter the distance or times zones or whatever. I believe in us🩵",
            "date": "April 2"
        },
        {
            "author": "Holleigh",
            "text": "Hey! This might be a long message or it might not be, we shall see by how much I ramble and type 😆 Zac, from the time I met you to the time we’ve been able to spend together over the phone it has been truly wonderful. You have shown me since the very beginning your true personality and your true self, I admire that. I know in today’s day and age it’s so hard to be your true authentic self, especially when the world around you tries to mold and shape you into who THEY want you to be. You’ve been your true authentic self through it all, since the first time we talked way back last year of June, to this January when you first reached out and even took that risk to talk to me. Going into 2024, I never thought that I would find someone like you. I had been by myself and single for nearly 2 years and I was as contempt as I could be. I’ve been told this saying that I believe to this day, “love will find you when you least expect it” and I truthfully and wholeheartedly believe that. Love will find you when you’re not looking. Through these past few months getting to talk with you, get to know you better and just to hangout with you it has truly been a blessing. You are such a God fearing man, your passions shine through you when you talk about them. I admire your strength, your joy, your compassion and your humor you carry with you daily. I know we haven’t met in person, but from the glimpses I’ve been able to have from talking with you, you are truly a remarkable and God fearing man. You push me closer to the Lord, and help strengthen my relationship with God. That’s rare and special. Your fruits of the spirit peak through and I’ve seen them since the beginning. Little things that I noticed. The choice to trust and to choose me, someone who is across the country in a different state. That truly is a scary thing to do, but with you it feels so natural. You squashed any worries I had when we talked the other day, and I haven’t second guessed my decision to be committed to you since your confession ast month! Growing up love was never showed to me in a healthy way in my household. My parents relationship is strained and it’s never been a relationship showing Gods love he wants for spouses. So I’ve had a flawed view of it growing up. But, my bestfriends family has shown me what love looks like. Through my last relationship, we immediately said those 3 big words on day 1, so I never knew what it was like because my 14 year old brain said it from the beginning. I’ve slowly realized that love comes in different ways, in friendships, the daily tasks we do everyday, Gods love for us seen in everyday life. With all my rambling, this does have a point I promise. Zac you show love and care in the sweetest ways, when I first played minecraft with you, you grabbed flowers from a trip somewhere and it made my heart soar. Your subtle hints and comments when we’d call and just all these little things meant a ton to me, it showed me a different way of care. You show it in remembering the small things about me, you show it in the most subtle but noticeable ways. I might sound crazy, who knows, we haven’t met in person, and I’m terrified out of my mind but I’m trusting God in this through it all. You have taken over my every thought, you plague my thoughts every single day 24/7. The smallest of things reminds me of you, the sunsets I see at Auburn, the sky, so many other things I could ramble on for forever. You captivate my every thought every single day,. Your smile, your laugh, the sound of your voice, the way you smile when you talk about something your passionate about. I love your beautiful smile, it lights up any room and it always makes my day when I get to see it your breathtaking eyes, my favorite color. Your eyes blue like the sea, as the blue winter sky and the ocean in the spring. Flawless just like the sky, they are the most beautiful shade and it made me fall in love with the color even more. I could ramble on for hours- days even, probably months about everything I adore about you. To say all of this, I am scared to write this out. I’ve been thinking on this and making sure that this was right before I typed it out or brought this to you- because no matter what I’m not perfect, but I want you to know that I will stay committed to you for the rest of my life. I feel like you are truly an answered prayer, and I’d do it all over again if it means I get to meet you and go through this adventure with you :) anyways- I’ve sat on this for a bit, because I wanted to get everything in check before coming to you about it. I’m in love with you, all the signs are there for me and I can’t deny it any longer. God has been nudging me and giving me so many obvious signs. You consume my every thought, just seeing your message pop up on my phone sends a smile to my face, getting to hear your voice and just talk with you or just hang out on call is the highlight of my week. I have something written down in my notes, and it’s called “what’s a soulmate” and it describes a beautiful description, saying how it’s like a bestfriend but more. The one person who knows you better than anyone, who makes you a better person. You inspire me to be a better person. Someone who knew you, accepted you and believed in you before anyone else did or when no one would. You’ve taken me all, in my flaws and everything you’ve still pursued me and reassured me through everything. Writing this out stressed me to the max- I was actually writing this out before you called me a bit ago haha 😆 But yeah, I love you Zac :) man. That’s wild to say. I don’t know if it’s crazy of me to say that because again, never met you and we’ve only been talking for a few months, but you’re different. You make my heart beat out of my chest and you give me butterflies and make me feel seen, heard and valued. I thank God for you every single day. There hasn’t been a day I’ve second guessed this decision. There is still something I do need to tell you moving forward in this relationship that we are building, but I did want to get this out there :) 🩵🩵🩵 \"Two are better than one, because they have a good return for their labor: If either of them falls down, one can help the other up. But pity anyone who falls and has no one to help them up. Also, if two lie down together, they will keep warm. But how can one keep warm alone? Though one may be overpowered, two can defend themselves. A cord of three strands is not quickly broken.\" ~ Ecclesiastes 4:9-12",
            "date": "April 7"
        },
        {
            "author": "Zac",
            "text": "Holleigh, after all my previous relationship endeavors, I can surely say that talking to you have been an entirely different experience than what I have been used to. Being in a relationship to me has always been so shallow. I’ve always been stressed pretending to be someone I wasn’t, I said things like “I love you” just cause I thought that was what you were supposed to do. Every time the Bible talked about love, it just seemed so foreign to me because of my experiences.  I’ve tried to hide my interests just to appease the person I’d talk to, and they would always be attracted to me on the surface, such as just my body or the fact that I play hockey. For the first time I can say I’ve built this relationship on being myself, approaching you under my twitter account, my most repressed interest. I’m serious when I say this, if I didn’t talk to you, I would still be lost, pretending to be someone I’m not.   From talking to you, I can really say that I love you and mean it. It’s funny, from the start I’ve had a naive sense of trust when talking to you. Now I know it isn’t naive, you are genuinely trustworthy, we’ve connected on such a deep level that I can’t imagine talking to anyone else, and I feel like you feel the same way. It’s ironic that this we are so far from each other, but this is the most genuine relationship I’ve had by far. I’ve felt God nudging me towards you in so many obvious ways as well, and I can see why. You have also strengthened my faith deeply, I’ve had such an easier time following the word of God ever since meeting you. You remind me of the entirety of Proverbs 31, especially the value of a God fearing woman in verse 30, “Favour is deceitful, and beauty is vain: but a woman that feareth the LORD, she shall be praised.” The best part is, I don’t have to worry about the beauty is vain part because you are beautiful :) Every time I see you smile, it’s so special to me. When you smile, your personality shines through it like nobody else. I’m blessed to be able to experience that personality every time I talk to you 🩵 From your instagram posts to even looking at you on FaceTime, I can’t stop smiling thinking about how pretty you are. I can’t look at any other woman the same after meeting you, and I don’t want to share my life with anyone else. I’m terribly sorry your parents haven’t been the perfect example of a relationship, but relieved to hear about your friend’s family. I’m happy to make the sacrifices to make sure our relationship is as healthy as it can be, and I’m ready to learn on the way, growing with every mistake. I know neither of us are perfect, but I know we can help each other in our flaws. I’m glad we’ve developed such a deep connection without ever seeing each other in person, I want to ensure you that I’m the same in person as I am online :) I’ve never felt more happy reading a message, thank you so much for spending the time writing it. I’ve got to get to sleep now, and I hope you have an excellent start to your Monday 🧡",
            "date": "April 8"
        },
        {
            "author": "Holleigh",
            "text": "G’Morning!!🩵 I hope you slept well and got enough rest!! Happy Monday!! Let’s make today great!!! 😄 I was not expecting this when I woke up🥹 this is such a sweet and heartfelt message, and I am grinning like crazy re-reading it over and over to make sure I’m not dreaming or hallucinating. I talked to you because of WHO you are, not what you do or what you look like, even though those are +’s 😉 There’s a verse I’ve kept close to me when going into this, 1 Samual 16:7 “Do not look at his appearance or at the height of his stature, because I have rejected him. For the LORD sees not as man sees; for man looks at the outward appearance, but the LORD looks at the heart.” I don’t look for looks, job, wealth etc.. those are all earthly things that will fade, but your heart and personality will stay no matter what! Matthew 6:21 For where your treasure is, there your heart will be also. Your heart shows your personality and who you are the most. I’ve grown up thinking I had to look a certain way, have this have that etc.. when in reality, it’s not what I look like or have, it’s my heart. Your heart is so precious Zac, from every encounter I’ve had with you, you’ve shown compassion, humility, thoughtfulness, care, joy, and so so much more. I’m so glad you decided to message me on Twitter, who knew that single message would lead to this great adventure :) you don’t have to pretend around me, I can promise you I won’t ever judge you. No matter what mistakes people make, I always show love, we aren’t defined by our mistakes. I’ve also had a naive sense of trust with you, I’ve become more trustworthy in life but with you it’s been different, you’re different! Especially from my baggage that I carry, it’s been so easy to talk to you and trust you. Haha I know right!! I don’t think distance matters when God is involved, no matter the distance, if it’s Gods will it’ll happen. I’ve seen His hand throughout these past few months, and that’s not by mistake! 🥹 this is so precious. I’ve dreamed and strived to be a Proverbs 31 woman 😆 it’s been pushed so much on women that it’s kinda been on the back of my mind to be a certain way etc… but with you I don’t have to act different or to impress, I can just be myself :) thank youuuu🥰🥰🥰 Gah this makes my heart soar🥹 I’ve never heard this before and I’m gonna tear up haha💙 Yeah, my parents relationship has always been rough, but I’m glad God placed my friend in my life so I could learn what biblical love is on the side. In a way it made me question it and I had the opportunity to dive in and learn more about it, and I’ve learned so much. I actually know so much, I have books on relationships and I’ve even done papers on the topic in highschool. I also act as a relationship counselor to my friends haha, God has given me an interest and love for it,, and just realizing that someone feels the same way makes me so so happy. I know I was destined to have a partner some day and God has been blessing me these past few weeks and I just can’t believe it. Zac you truly are one of my greatest blessings to come out of 2024🩵 I’m ready to grow alongside you in our journey, no matter where it takes us :) I’m really glad we’ve developed the connection while never met, I think it holds a deeper foundation for us, some people rely on seeing their bf/gf daily and having that physical connection, but the strongest foundation is on the Lord. I can also ensure that I’m the same person I portray online aswell, I’m always my true authentic self no matter where I’m at or if it’s on social media :) Thank you for spending the time to write this out🩵 it made me smile getting to read though this :)) I hope you got enough rest and you’re ready to take on another day!! I thank God for you every day Zac🩵 thank you for choosing me :) it means the absolute world to me",
            "date": "April 8"
        },
        {
            "author": "Holleigh",
            "text": "I hope you have such a blessed & great night tonight Zac!🩵 thank you for taking time out of your day to hang out with me! Even if it’s to do homework, play games etc….! I always love spending time with you :) 💙 thank you for choosing to spend that time with me,, I really appreciate it more than you’ll ever know! I’m really thankful for you. I probably say it all the time but I really really am, you’ve been a light and pushed me towards my relationship with Christ,, you’ve slowly been healing some of the broken parts of my heart and I want you to know how grateful I am for you. 🩵 I know it’s only been a few months but I feel at peace with you, I trust you so much and I’m so comfortable talking with you. I’m really glad God placed you into my life, I hope you have such an amazing and blessed night tonight! I can’t wait for the day I get to see you in person and give you the biggest hug ever :) 🩵 here’s to seeing you soon 💙💙 G’Night Zac",
            "date": "April 10"
        },
        {
            "author": "Zac",
            "text": "Get some rest tonight Holleigh 🩵 No need to thank me, every day is a blessing and even more so when I get to spend time with you. I really want you to know that you are an amazing person, that you should never discount yourself. I’m glad you share your time with me, you are valuable and it’s an honor to be dating you 🥹 Knowing that I’m helping in your healing process encourages me, and I’ll do anything to maintain a healthy relationship to continue healing you ☺️ When I see the art you make and get to see your silly personally it makes me go wild that I get to have you in my life :) Looking at your card project and sunset scene today, it’s clear to me that you are making magic, no matter if you are working at Disney or not. Keep up the hard work, God will use you for great things. Colossians 3:23-24: “And whatsoever ye do, do it heartily, as to the Lord, and not unto men; Knowing that of the Lord ye shall receive the reward of the inheritance: for ye serve the Lord Christ.” I’m going to check flight prices this weekend and plan a weekend to come out, cause every day I can’t hug you when hanging up on  FaceTime sucks 🧡🧡",
            "date": "April 10"
        },
        {
            "author": "Holleigh",
            "text": "G’Morning🩵 this was so so sweet to wake up to Zac🥹 every day is a blessing and more the time I get to spend with you aswell, I always look forward to it! 🥹 I really appreciate you,, you have truly been helping me heal in more ways than one,, I still sometimes fight with my head but you squash every insecurity and doubt as soon as it surfaces, I don’t know how I got so lucky to gain you in my life!! I love making artwork for you, it’s a way to express my gratitude and thanks and adoration for you!🩵 I’ve never thought of it that way, that’s such a cool and new perspective to it!! I love that verse, I remember falling back on it at the beginning of my Design journey, I love that you lead me to Jesus and speak His words and truths 💙 EEEEE🥰 This gives me so much excitement and hope!! Everyday I’m not able to hug you sucks haha, but I know it’s all going to be that much more worth it when I get to see you in person🩵🩵 you are worth the distance. Always. I hope you got so much rest ! I pray coffee was d a nuisance 😆 I hope today is a great and productive day! I know Thursdays are busy, I pray the lord gives you strength and peace as you go throughout today, finding every opportunity to see his blessings and goodness all throughout your day!! Today is another great day, and you’re going to do so many amazing things!!🩵 “The Lord is my strength and my shield; in him my heart trusts, and I am helped; my heart exults, and with my song I give thanks to him.” Psalm 28:7",
            "date": "April 11"
        },
        {
            "author": "Holleigh",
            "text": "I also wanted to check in about something, I know in the beginning when we both confessed to liking one another, I had mentioned that I wanted to meet you in person before we put a label on it, but honestly now I don’t really care about it. You’re the one whom my heart desires and adores, and I just wanted to ask if you wanted to wait until meeting to put a label on us or go ahead and do it! No matter what, just know that I’m yours no matter what :) there isn’t a doubt in my mind or a hinder in my decision to be with you Zac🩵 I just wanted to ask and see what you were thinking, this is a two person decision I feel like! If so what date would it be that we “got together” if not when we meet",
            "date": "April 16"
        },
        {
            "author": "Holleigh",
            "text": "I definitely am :) I’ve been praying about it and talking to a God for a while now! I trust you completely, you haven’t given me any reason not to trust you. You’ve been open, communicative, friendly, caring, compassionate and through everything cheered me on and stood by my side. I have healed enough to go through with this, I am completely different than I was in January. I’ve learned so much, grown in my faith with the Lord and you’ve been helping me even if you don’t think you have been, but you’ve been a big help to me these past few months. Heck yeah, let’s call the date when the bracelet comes in!!! :D 💙 of course! I’ve been sitting on this for a bit, I was nervous to approach you about it but this eased all my worries. I couldn’t see myself with anyone else either Zac, I truly believe Gods brought us together 😄 I was also reminded of this verse last night, and I thought I’d share it! It’s a great verse to fall back on for us ”It was also called Mizpah, because he said, “May the Lord keep watch between you and me when we are away from each other.“ Genesis 31:49 NIV",
            "date": "April 16"
        },
        {
            "author": "Holleigh",
            "text": "I’ve had this sketch sitting in my iPad for two years, I started it May 9th, 2022. I told myself after everything that this sketch was going to go to someone special one day, and I’ve waited to finish it for two years. I’ve come back to it to alter it a bit but always left the male character blank. Today, I decided to finish this piece. I haven’t drawn something like this since February for my Valentine’s Day artwork, but I decided it was time to finally finish this. What once was a blank canvas, now holds new meaning with new characters. Signifying a new chapter :) I’m glad that this piece has your character in it, I’m honored to be stepping into this next chapter of my life with you by my side Zac🩵 I also had these words written for this sketch, I re-visited the song and it explains everything I feel for you",
            "date": "April 16"
        },
        {
            "author": "Zac",
            "text": "Hahaha Holleigh I’m at the gym right now and I can’t stop smiling, it’s hard to keep my composure when you send something like this!!!! 🥹💙 Seriously I’d love nothing more than to be the man in your life, knowing you’ve saved that spot for years and have decided to allow me to fill it warms my heart and soul. I’m excited to treat you right, unlike you’ve been treated in your previous relationship. I’d never thought I’d find someone like you, you are truly one of a kind and I don’t know what I’d do without you. What a beautiful piece you’ve drawn, and the song is so perfect for it. I see us in that piece, but I also see the Lord. He worked in you to draw it, and he will work in us to build a Godly relationship. I’m committed long term, and honestly work has been a drag lately and it was hard finding motivation to work hard, but with you in my life, I’ve got more motivation now than ever. I can’t wait to hug you in person 💙💙 and I want to work hard so that distance doesn’t have to be a factor and I can hug ya everyday :)",
            "date": "April 16"
        },
        {
            "author": "Holleigh",
            "text": "G’Morning!! I hope you slept so well and got enough rest to take on today!! Happy Saturday!! Praise the Lord it’s the weekend!!😁 I just want to express how thankful I am for you Zac🩵 I was never expecting to find someone as gracious and loving and caring as you, but the Lord had other plans. I stumbled across this Bible verse the other day, and it immediately reminded me of you💙 “Husbands, love your wives, just as Christ loved the church and gave himself up for her to make her holy, cleansing her by the washing with water through the word, and to present her to himself as a radiant church, without stain or wrinkle or any other blemish, but holy and blameless. In this same way, husbands ought to love their wives as their own bodies. He who loves his wife loves himself. After all, no one ever hated their own body, but they feed and care for their body, just as Christ does the church— for we are members of his body. “For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.” Ephesians 5:25-31 From the day I first met you up until now, you have shown the fruits of the spirit, loving, caring, humbling. Since stepping into this friendship that blossomed into something beautiful, you have always shown Gods love and His care towards me. You have had patience with me and shown me humility and humbleness throughout it all. I’m truly honored God decided to bring you into my life Zac!🩵 you have changed it for the better, I couldn’t imagine my life without you now! I’m really excited to see where God takes us heading forward💙 I’m so thankful for you, I’m so in love with you. All of you. I love your smile, it lights up any room, and it always brightens up my day no matter what, I love the sound of your voice, I love your laugh. I love your personality, it radiates joy and Christs’ love and His joy! I cannot wait to see you in 25 days🥰",
            "date": "April 20"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin!!🩵 I can’t wait🥰 I find myself admiring you on Facefime too and I just smile seeing you and your beautiful smile🥰 I love you so much too🥹 gah- this is so surreal in every lifetime I’d chose to be yours Zac💙 thank you aswell for being mine- it truly is so lovely getting to do life alongside you. I cannot wait to give you a big hug when I see you so so soon!!! Thank you!! I pray you got enough rest to take on today!! You’re going to do so great this week, Gods got us no matter what!!! “Peace I leave with you; my peace I give to you. Not as the world gives do I give to you. Let not your hearts be troubled, neither let them be afraid.” John 14:27",
            "date": "April 22"
        },
        {
            "author": "Zac",
            "text": "Assuming you were asleep, or at least trying to get some sleep, which is good cause you always need it haha. I just want to reassure you, even though I’m sure you don’t need it, that I don’t ever want you to go through the stresses of life alone. 💙 I recently saw the verse Galatians 6:2, “Bear ye one another’s burdens, and so fulfil the law of Christ” and it reminded me of us. It might be hard because of the distance, but it really occurred to me that you’ve been going through life and some tough times alone. I want to reassure you that I’ll always be here to carry your burdens with you no matter how heavy they might be because I really do love you ☺️ Thank you for staying strong and being bold out there without me, I’m so proud of what you have accomplished, and I can just tell God is guiding you to accomplish so much more. I pray that you have a wonderful day tomorrow, and I’ll talk to you soon my love 🙃💙",
            "date": "April 24"
        },
        {
            "author": "Holleigh",
            "text": "Talking about For King and Country - Seasons: Also wanted to send this song- as soon as fK&K released it, I knew it would be special in the future. I really adore this, it explains 1 Corinthians 13:4-8 and it embodies the most truest form of love,, love never fails. I saw a quote that said “the Bible says love never fails, so if it fails it wasn’t love” and it made me reflect on what love is and what it means. I have a ton of Devo’s on love and books about the subject. I was obsessed with it in Highschool cause I guess I never received it correctly,, but I’ve learned slowly overtime what true love is from the Bible and from friends etc… as soon as I heard this from their album it immediately became a favorite. This song embodies everything I feel for you- no matter what I’m here and I’ll love you through the seasons, no matter what we go through. 🩵",
            "date": "April 24"
        },
        {
            "author": "Holleigh",
            "text": "I’ve had conversations with both parents about you now- and they’ve both been super well :) I’m excited for you to meet them🩵 I hope your project is coming along well!! Remember to take breaks, drink water and eat dinner if you haven’t yet! You matter more than this project. I’m thankful for you, thank you for choosing me to do life with. I know we’re across the state from each other, and I really appreciate you and everything you’ve done and continue to do for me. I pray this project goes smoothly for you and you get a break this weekend ! I’m so proud of you and everything you’ve accomplished and will accomplish from this day forward!! God is going to use you to do amazing things Zac!! 💙💙 I love you, all of you. Thank you for being mine🥰 I’ll talk to you tomorrow my love🩵 John 14:27 Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.",
            "date": "April 25"
        },
        {
            "author": "Holleigh",
            "text": "G’Morning!🩵 happy Monday!!! It’s the start of the week! As you step into this final week of your semester, I pray the lord will guide you and your steps and actions throughout ! Your dedication, hard work and your persistency is paying off!! I’m so incredibly proud of you Zac! No matter what, you’re going to do and accomplish great things!! :) You’ve got this, I believe in you! I pray this week is one of peace, calmness and the Lord gives it to you and his spirit of Joy ! Finals week is often so rough and hard to find joy in, I pray you find it in the little things! I also wanted to show this piece of art I got for us!! I saw this scenery piece and knew our characters would be perfect in it!!! 🩵🩵 I’m so thankful for you :)",
            "date": "April 29"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin !!🩵 Happy Thursday!! We’re almost to the end of the week AND the weekend!!😁 I know today’s going to be a long day, I pray God gives you peace and joy as you go throughout the day!! There is so much joy in each day and I pray the Lord is able to make the most of it even in the little moments ! You are doing so many amazing things !!! I pray the Lord will guide your steps and shine His light and love through you today for everyone to encounter!!! You are a blessing to me and everyone that encounters you!💙💙 I’m so blessed to have you in my life and know you! You gave my life a brand new meaning and brought color into my life ! I’m truly honored I get to do life alongside you and with you🩵 I hope today is as amazing as you are!🥰 I love you and I’m so thankful for you, always!! Philippians 4:6-7 Don’t worry about anything; instead, pray about everything. Tell God what you need, and thank him for all he has done. Then you will experience God’s peace, which exceeds anything we can understand. His peace will guard your hearts and minds as you live in Christ Jesus.",
            "date": "May 9"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin love! Happy FriYAY💙 yayyyyy!!!!😁 I’ve been waiting for it to release for a while now! As soon as I heard it it immediately reminded me of you🩵 I hope your game went well last night and you get great rest and enjoy sleeping in!! You deserve it!!! 🥹 This means so much to me Zac, I always appreciate your kind words!! I’m so honored to call you mine Zac, you truly embody everything in a Godly relationship and as a Godly boyfriend! I’m so excited to grow alongside you and in our relationship together!! Whatever comes, whether there’s distance or not I believe we will make it, Gods got us no matter what! Distance doesn’t matter because I have you. Knowing I can wake up every day and have you by my side is worth any miles between us🩵 I’m truly blessed to call you mine🥰",
            "date": "May 10"
        },
        {
            "author": "Holleigh",
            "text": "Good evening love, I hope your night is going well :) I just wanted to say I’m thinking of you.🩵 how grateful and thankful for you I have been ever since you came into my life. Ever since that phone call in January, my life changed forever, for the better. These past few months have been nothing but blessed. Getting to know you and build this relationship has been wonderful, and nothing like I could have ever imagined. Some days I wake up wondering how I got so lucky to call you mine? How in the world out of everyone on this planet that you chose me. I find myself pondering how I got this lucky to have someone as wonderful and caring, loving and so kind in my life- how did I deserve to have you placed into my life? You are an answered prayer Zac. I don’t know if you know the extent to it- but you truthfully are. If little me knew I’d have you in my life she would freak out haha. I’d grown up watching Disney movies and hearing love stories wondering about the day I’d get someone like that- while God had other plans for a while, you have exceeded every vision and thought and everything I’ve read about love. You’ve shown me care, kindness, compassion, joy and so much more. You show it to me every day without fail. You have showed the fruits of the spirit countless times and have showed me patience. Your presence in my life brings me so much happiness, and I can’t imagine my days without you. You’re more important to me than you’ll ever know, and I want to make sure you feel loved and valued every single day. I thank the Lord every day for you, praise him for bringing you into my life and writing you into my story. I’m so incredibly happy to see you on Wednesday, to finally give you the biggest hug and to finally have you in my arms. I love you and I’m so happy I decided to answer your call in January :) I can’t wait to see all the Lord has in store for us🩵",
            "date": "May 13"
        },
        {
            "author": "Holleigh",
            "text": "I completely understand that, it’s scary typing that out and waiting a response ! Of course, no matter what you’re stuck with me 😁🩵 You are so deserving of love!!! You don’t have anything to apologize for, I’m glad and so proud you did. I really appreciate you more than you know. You’ve achieved so much despite everything you’ve been through and it really shows Gods faithfulness and His movement in your life! I can’t wait until tomorrow, I’ve been nonstop thinking about it today and it’s not gonna stop anytime soon- my mind has constantly been on you all day and I’m not complaining 😌 I can’t wait to finally hug you and just to see you in person. I’m so glad you could find time to come down, I’m thankful for you always🩵 I promise to love you no matter what, through the good, the bad and everything life throws at us. You’re worth it",
            "date": "May 14"
        },
        {
            "author": "Holleigh",
            "text": "G’Night my love🩵 thank you for being vulnerable tonight with me, I loved getting to talk with you and talk about our future :) you don’t have anything to worry about okay? I love you. All of you, that doesn’t change no matter what. I’m excited to continue this relationship with you, I’m so happy you got to come down💙 I’m so incredibly thankful for you. You are an answered prayer. I’m madly in love with you and nothing will ever change that, I hope you’re able to get a good nights rest🩵 I’ll see you tomorrow 😘 I love you. I love you because you actually put effort into me. I love you because nobody has ever given me the love that you have given me and you are the only one that could ever love me this way. I love you because you always make me feel that I am worth something. I love you because you make me smile when I almost had forgotten how to. I love you because you have a huge and honest heart. I love you and every little detail about you. I love you because you are simply you🩵 I just wanted to take a moment to remind you of how incredibly special you are to me. Your presence in my life has brought an abundance of love, joy, and happiness that I never knew was possible. From the way your eyes sparkle when you smile, to the gentle touch of your hand in mine. Every moment spent with you feels like a dream come true. You have a way of making even the simplest of moments magical, and I am endlessly grateful to have you by my side.",
            "date": "May 18"
        },
        {
            "author": "Zac",
            "text": "Goodnight :) This has been such a great weekend for me Holleigh and I know there are going to be even better coming up 🩵 I feel comfortable around you and normally it’s really hard for me to feel like that around anyone, but you are so special to me 🥰 I love and adore you so much, I can’t believe I found such a diamond hiding across the country in Alabama 🥹 It was great to meet your family, at least the good side of your family. I appreciate you opening up about your family’s issues to me, you are incredibly strong getting through that with everything you have accomplished. Get some rest tonight, I’d be happy to drive to the airport tomorrow, you’ve sacrificed so much for me to so far, it’s the least I could do. Feel free to bring your iPad if you want to draw or anything!!  💙",
            "date": "May 18"
        },
        {
            "author": "Holleigh",
            "text": "I’m so thankful you were able to take a trip down here to meet my family and hang out🩵 I’m forever thankful for you Zac. You truly are an answered prayer, I thank God for you every single day. I’m so madly in love with you and everything about you. I can’t get you out of my head and I don’t think I will ever be able to. You are everything in a man I’ve prayed for, for so long. I’ve never felt this content and safe around someone and you feel like home :) I’m so lucky to have you by my side and do life with, I’ll forever cherish the memories we made on this trip and the ones to come!!! I’m truly grateful to be in love with someone who makes saying “see you later” so hard. I know it was God that brought us together from the start, to fall in love with your personality before ever meeting or anything else. I’m living one of my answered prayers right now and I couldn’t be more grateful. I’m literally obsessed with you, loyalty isn’t something you gotta ask for. I only see myself with you, I wouldn’t waste that for anyone on this planet. You are the brightest star in my sky✨💙🌌 I love you and I can’t wait for what God has in store for us :) loving you is worth the distance. Love knows no distance, I’m so proud of you and forever thankful for you my love🩵",
            "date": "May 19"
        },
        {
            "author": "Zac",
            "text": "HOLLEIGH I LOVE IT 🩵🩵🩵 THANK YOU SO MUCH YOU ARE THE BEST 🥰 Every time I see our sonas together it makes my day :) It really feels like they are us and I can’t get that out of my head 🙃 It’s also so accurate cause I would not step in that river 😭 All of the art you’ve gotten me and especially drawn shows how compassionate you are, you are so precious to me Holleigh, I feel so warm inside knowing that I get to have you 💙 You are the woman of my dreams, and I’m still just star-stuck every day that I wake up and get to talk to you. You are beautiful inside and out, head to toe, I’m so proud of you for getting to here in your life. Your light shines the brightest around others and I’m blessed to see it so much in my life. It’s taking everything within me to stop myself from running to Alabama to be with you. I want to kiss and hug you everyday, make you breakfast, lunch, and dinner, make sure nobody ever hurts you again. I want to buy you all the art supplies you ever dream of so you can use your God given talent to the max. I have an itch that only you can scratch and I thank God every day for you 🩵🩵",
            "date": "May 22"
        },
        {
            "author": "Holleigh",
            "text": "Oh my goodness this message has me GRINNING from ear to ear🥰 I can’t get this smile off my face🥹 I love getting Giftart of our sonas!!! That’s so true you wouldn’t 😂 I chose well haha!! Gah how in the world did I ever get so lucky to call you mine🩵 you’ve shown me love that is gentle, compassionate, caring and Godly. It takes everything in me not to fly to Arizona every day, I can’t imagine my life without you. Ever since you came into my life you’ve changed it for the better. I can’t wait for the day where we will be by each others sides for good and distance won’t be a factor we have to worry about💙 Your words truly mean the absolute world to me🥹 really feeding into my love language right now haha! I’m truly so very blessed and so thankful God gave me you Zac!! You have showed me what true love looks like, you are such a hard worker and you are accomplishing SO much ! I’m so proud to call you mine and get to experience your walk through life and all your achievements 🩵 I thank the Lord every waking moment for you, you truly are a blessing. The best blessing to come out of this year🥰🩵 I can’t wait to have you in my arms again, kiss you, just be with you and make many more memories and go on many more adventures!! You’re my greatest adventure 💙 as long as I’m with you, I’m home :) I’ve heard relationships don’t complete you, they add on to you and you’ve certainly added on to my life in the BEST way🩵 how lucky I am to have you in my life🥰 I love you so much, past the stars in the galaxy, to the moon and back a million times, loving you is an ocean and I can’t hold back 🌊 You’re my greatest blessing, I’m so thankful for you my love! I love you and adore you, always",
            "date": "May 22"
        },
        {
            "author": "Zac",
            "text": "If all else fails Holleigh, I’ll stay by your side no matter what 🩵 I understand I’m madly in love with you right now and my brain is screaming at me that you are the most perfect woman on the Earth, but when the honeymoon phase is over I promise to stick with you. I’m so emotionally attached to you, it’s deeper than my addiction to you. I promise to be the man you deserve in your life 🙃 You make me feel so loved all the time it’s truly incredible, you are doing a great job and you are teaching me many things about what a healthy Christian relationship is supposed to be like. I’m sorry that I’ve been busy lately with work and this online class I’m doing, but it’s for the best so that we can have a bright future. Loving each other long distance is going to require some big things out of both of us, but we’ve got this. You’re gonna have to stay strong and independent when I’m not around, and I know you can do this because I know your story and what you have pushed through. Surround yourself with more and more Christian friends, and be a guiding light for Sigma Phi Lambda. I know there’s going to be more Holleigh’s out there that need their Lauren, you’ve grown so much into a social butterfly I know you’ll make an impact on many others 😊 I know earlier I said no more character development, but I lied, you’ve got a whole campus, circle of friends, and family to share your love with and change lives. It won’t always be easy, but take advantage of the good direction life has turned for us and share the joy with others! You are already rubbing off on me in so many ways, I’m looking to join a small group at my church, I’m gathering all of my friends birthdays to give them gifts, and I’m going to send Lauren a nice message Friday in preparation for you coming to hang with her. I’ll keep you in my prayers always and will be there for when you need to lean on me. I know you will do great, your kindness reflects the love and compassion you carry in your heart, your wisdom on things like relationships and life’s troubles is valuable to others, you have a nurturing spirit, you are a woman of virtue and integrity, and very humble, sometimes too much!! Sometimes your eating habits scare me, I want you to get the nutrients you need to stay healthy for our whole life together, I don’t want to be demanding or anything but don’t forget to care for yourself, your body will love you for it, kay? 🩵 As I write this I look over to the lamb on my drawer next to my bed and I think about yours and everything it’s seen and been through. It’s starting to make me emotional again, but from here on out we will share the burdens of life. I choose to love you 😘 Song of Solomon 8:6-7 (KJV): “Set me as a seal upon thine heart, as a seal upon thine arm: for love is strong as death; jealousy is cruel as the grave: the coals thereof are coals of fire, which hath a most vehement flame. Many waters cannot quench love, neither can the floods drown it: if a man would give all the substance of his house for love, it would utterly be contemned.”",
            "date": "May 23"
        },
        {
            "author": "Zac",
            "text": "I pray you’ve slept well Holleigh, I’ll probably be sleeping in cause it’s late. Have fun at the soccer game and enjoy the valuable time with Lauren, I know she appreciates every minute with you, I know I’m jealous she gets to be with you right now 🙃🩵 God has been so good to me putting you in my life, I swear I go to sleep with a smile on my face every night. You show your love for me and those around you in so many ways. I still can’t stop looking at all the art you’ve given me, the lamb on my table, the beautiful texts you send me, and thinking of the days we spent together 🥰 You mentioned earlier that all you want to do is draw pretty pictures instead of working an office job. I’m here to tell you your pretty pictures are more than pretty, they are unique, soulful, vibrant, and most of all magic 😌 The whole world needs to see your art!! Anyways, have a great day with Lauren today, try not to think about me all day, I know I won’t be able to stop myself from thinking about you 😘",
            "date": "May 25"
        },
        {
            "author": "Holleigh",
            "text": "My love for you is like an endless ocean, it goes beyond what the eyes can see and what words can express. There hasn’t been a day that I stopped wanting you and you haven’t gotten out of my head at all since I first met you🩵 in your arms, I have discovered a peace that I never knew existed. Your laughter is a melody that echos in my soul, bringing joy to even my darkest days. With every beat of your heart, I feel more connected to you, as if our souls were destined to dance together. You are not just my love, you mean everything to me. I love you for all that you are, all that you have been, and all that you will be💙 You are the embodiment of everything I’ve dreamed of and prayed for, and being with you feels like home. Your presence fills my heart with happiness, your touch ignites my soul with passion and your love envelopes me in a warm embrace that comforts and reassures me in the darkest of times. You are my confidant, my bestfriend and my partner in crime. I am grateful everyday for the gift of your love. Together, we can conquer any obstacle,  weather any storm and overcome any challenge that life throws our way. With you by my side, we can conquer anything. “I found the one my heart loves” Song of Solomon 3:4 💙 “I thank my God whenever I remember you” Philippians 1:3 “Love is patient, love is kind. It does not envy, it does not boast, it is not proud.” 1 Corinthians 13:4",
            "date": "May 30"
        },
        {
            "author": "Zac",
            "text": "What a treat this has been to read 🤍 it’s so reassuring to hear something so beautiful come straight from your soul :) You are my sanctuary from the chaos of the world around me, someone I can look forward to fill my love tank when it needs it the most. You are the other half I have been missing my whole life. You are the most precious thing, from your smile when you pick up my FaceTime calls to when I can tell your heart is about to beat out of your chest at even my small compliments. You are the dream I dared not dream because it seemed to perfect to ever come true. Your love is the blanket that keeps me warm inside and out, your touch the spark of divine passion. I’m endlessly grateful for you and the unshakeable bond we share. I listened to Long Haul a few times now, it’s not only a great song, but the lyrics resonate with me. I’m in it for the long haul, my heart is fixed. Thanks for adding another song to the soundtrack of our love story 😘 I pray you get rest tonight, I know I’m sleeping in for sure!! Conquer the day tomorrow, and I love youuu :) And don’t tell Lauren you called me your best friend!!!",
            "date": "May 31"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love🩵 pray you’ve rested well, and slept in !! I hope your hockey skate went well !!! This was beautiful to wake up to🥹 it made my day 100% better. I never knew dreams could become a reality until God gave me you. Out of all the prayers I’ve prayed, your heavens answer💙 You’ve shown me that true, Godly love exists,, I gave up on finding it, but God knew what He was doing all along. I had to give up on it for Him to give me the most precious and amazing man. You have defied all odds and have reshaped my way of what love looks like, you embody Christ’s’ love and biblical love to a T. You’ve shown me that love knows no distance, even miles apart and I feel more connected to you than I ever have with anyone else. I know God was and still is, in the middle and the foundation for this relationship. Like the song Long Haul, I’m in it for life! I choose to love you till we’re old and grey lord willing🩵 you are the one I want to wake up to every morning, you are the one I want to build a future with, you are the one whom I wanna grow old with💙 I’m so incredibly blessed and amazed that God gave me something so precious and nothing like I’ve ever known. You truly are a miracle from God. I love you so so much, always and forever 🥰 I can’t wait to see how God writes our story and all the amazing things to come in the future ! I’m excited for the future with you,, no matter what life throws our way, I know I can conquer anything with God and you by my side🥰🥰🩵 I love you, take on the day today with Joy and positivity! It’s the weekend !🥳 Hahahaha I won’t 😂 you really are my bestest friend tho :))",
            "date": "May 31"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my handsome man🩵 your love is the sunshine that warms my soul each and every day☀️ I hope you slept well and are ready to take on the day!! Forever thankful for you and this life we get to do together :) The day I met you I began to forget a life without you. I feel so lucky to have stumbled upon someone as special as you, God really knew what He was doing all those years ago :) in every lifetime, I’d chose you. You are my blessing, my miracle, my love, my darling, my bestfriend🩵 I know the Lord has great things in store for us, I can’t wait to take on this life together. I hope today is as wonderful as you are my dear, go out and be the light I know you to be!",
            "date": "June 3"
        },
        {
            "author": "Zac",
            "text": "Thanks for the message 🩵🩵🩵 I seriously cannot stop smiling all the hours of the day. You are my soulmate, the one who I’m destined to do life with. You are the woman of my dreams, and life feels like a dream with you in it, I hope I never wake up!! It’s a blessing every day I get to wake up and spend the day loving you. You are capable of doing everything you set your mind to and more! I’m so proud of you, and I’m proud to call myself your man. You are precious, gorgeous, loving, caring, strong, sweet, and everything in between. Let God work through you today and do everything for Him 🥰",
            "date": "June 3"
        },
        {
            "author": "Zac",
            "text": "You are genuinely the most loving person I have ever met 😭😭 I’ll never stop giving you the love you deserve and more!! 🩵 I’m glad we got to talk even if it was for a brief amount of time. I cherish every second spent with you and my heart skips a beat thinking about all the time in the future we are going to spend together. I can’t imagine a better person to share life with and I’m smiling cheek to cheek while writing this :) I had a good time with my family and have been catching up with one of my friends that we played with. Praying you get some rest tonight, and you have a wonderful morning tomorrow 🥰",
            "date": "June 4"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin love🩵 gah you are the sweetest ever😭 you’re the most loving person I’ve met, uno reverse😎 I’m so glad we got to talk aswell! No matter how much time, I always enjoy it and savor the moments we get to talk!! I couldn’t imagine myself with anyone else, I do hope we get to spend together forever 🥰 the Lord was so gracious when He gave me you, I never knew a love like this existed, and you’ve shown me that it is out there. And I’m lucky enough to call you mine💙 So so glad you had a wonderful time with your family!! I know fellowship with others is so important as is family time! Thank you!! I pray you got enough rest to take on today!! You’re going to do amazing things :) you’re working so hard and it’s all going to pay off!! I’m so incredibly proud of you🩵 I love you and adore you, always",
            "date": "June 5"
        },
        {
            "author": "Holleigh",
            "text": "🥰 G’Mornin my handsome man, I hope you slept well last night! Thank you for being mine, it’s such an honor to be loved by you and to be able to take on life alongside you! I never knew a love like this existed until God placed you into my life🩵 You have shown me a love that’s gentle, caring, honest and most of all, biblical. I think of 1 Corinthians 13:4-8 everytime I think of us and you. You love with intentionality and you choose to, which is beautiful. I’m so honored God decided to place us together, I promise to love you always, you are my rock, my person, my bestfriend, my lover. I love you always🩵 I pray today is as wonderful and magical as you are!! Take time to relax and rest today, you deserve it!!",
            "date": "June 7"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my handsome man🩵 This was the best to wake up to, I definitely will have a smile all day😁 I always enjoy drawing for you!! It’s one of the things I enjoy most, and to see your smile is a reminder of why I do it! You are deserving of love and so much, I’ll spend the rest of my life giving you the love you deserve and spoiling you 💙 I’m so blessed God wrote our stories intertwined,, you are the BEST thing to come out of 2024!! You are what I’ve been praying for, for all these years. And to know the Lord has granted my prayer is everything to me. You mean everything to me. I promise to love you with all that I have, you are one of my biggest blessings Zac🩵 I can’t wait to see what God has in store for us, and the blessings and adventures we will get to take on in the future !! I love you 💙 I hope today is as amazing as you are!!",
            "date": "June 17"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin love!!🩵 Happy Tuesday !! I hope you slept well last night !! I’m so glad I got to talk with you yesterday ! You always brighten up my day :) my sunshine on a cloudy day☀️ I pray you got enough rest and you’re ready to take on today!! I’m so blessed God gave me you. You’re my first, and I don’t mean my first kiss, or my first relationship, or my first I love you. You’re the first person who makes me feel like I’m enough, and the first one to show me what I love you actually means. Thank you for showing me what love is and means, thank you for giving me the love I’ve always dreamed about since a kid. Gods love is unconditional, and now I get a taste of what His love is through you. You have shown me a care, compassion and adoration I never knew existed. Your love is quiet, in the whisper of your words, in the touch of your hand, in the gentleness of your smile, in the kindness of your eyes and the joy of your laugh. I love the way you love me Zac. I’ll continue the rest of my life loving you, striving to biblically love you and stand by your side and be there for you no matter what. It’s us against the world, no matter what trials come at us, you’ll always have me to lean on in times of trouble or rough days. I love you so infinitely, my love for you is as the grains of sand on every beach🩵💙 I’m truly blessed to call you mine, and always remember. My prayers hold you when my arms cannot Mark 10:9: Therefore what God has joined together, let no one separate.",
            "date": "June 18"
        },
        {
            "author": "Zac",
            "text": "Thanks for this wonderful message to wake up to 🥹🩵 When we first explored the idea of dating each other and I said I date to marry, there hasn’t been a second where I’ve doubted my intentions otherwise. You’ve been the light in my life, and I feel closer to God than ever. I only dreamed of you, never knowing that you were real. I treasure each message I receive from you and it keeps me going day to day. Knowing I have your prayers to hold me gives me strength to keep working hard daily. We are a team, you and I, till the end. I’ll love you every second of the way. Can’t wait to talk to you again today, it’s all I think about. 10 more days 🩵🩵",
            "date": "June 18"
        },
        {
            "author": "Holleigh",
            "text": "🥰🥰 G’Mornin love ! Happy Wednesday!!! 2 days away from finally having you in my arms!! My answered prayer, my bestfriend, my lover, my partner in crime, my person. I thank God for you every single day I wake, since He placed you in my life, it has been nothing but sweet. He was so gracious in giving me you, you’ve changed my life for the better. Showed me what a Godly man and what Godly love is like. When I told you about my past, you didn’t run. You didn’t change me, you didn’t think I needed changing. I will forever praise the Lord for seeing me fit for you. You are the epitome of Godly love, patience, joy, care, humbleness and much more. Thank you for choosing me out of all the billions of people in the world. I love you more than the stars in the sky, I pray today is as amazing as you are!!!🩵💙",
            "date": "June 26"
        },
        {
            "author": "Zac",
            "text": "Made it to the gate, waiting to board :) Good morning love 🩵 I pray you got some rest, hoping to not see a good morning text until later so I know you’ve slept in ☺️ I hope your day up until you see me later goes fantastic, but I’ll make sure the rest of the day goes great for us :) You are my dream woman, a true woman of virtue, and I’m blessed to be able to hold you in my arms today. It’s truly bizarre that we are both on this planet only born 11 months apart, God really created us for each other 🥹🩵",
            "date": "June 28"
        },
        {
            "author": "Holleigh",
            "text": "I’m so thankful for you and everything you’ve done for me and continue to do🩵 You are such a blessing to my life. God knew my heart needed you. In you, I have finally found all I never dared dream I could deserve or have- the kind of love that is rare. Being known in a way that touches the deepest parts of me. Accepted in a way that blows my mind. In you, the love I have always desired to give now has a place to call home. I have been a skeptic, but you are my undeniable miracle. The questions don’t matter anymore. We have finally found each other, and that is enough💙 You are the end of my road. After a lifetime of missed exits and wrong turns, you feel like I’m finally home. One journey ends, and another begins with you🩵 You are all I ever wanted love to be. I love all of you, even the parts you think are not worthy of love. You’re worth every mile between us. Always remember, my heart holds you when my arms cannot🩵💙 I love you always and forever my lover \"It was also called Mizpah (watchtower), because he said, \"May the LORD keep watch between you and me when we are away from each other.\" -Genesis 31:49",
            "date": "July 4"
        },
        {
            "author": "Zac",
            "text": "Good morning my love 🩵 I pray you get rest this morning and are blessed to sleep in. I adore reading that text, and I adore you 🥰 It’s only been a day, but I miss you dearly. The short trip so far has me wanting more than anything to hug you tight again. I love being able to talk all about you in front of extended family, and I sit there and smile for minutes after you are brought up. I wore the shirt you gifted me yesterday with pride knowing that I’ve got a one of kind woman who’s got everything I’ve ever desired. I went through all our pictures and art you’ve given me this morning, just reminiscing about you, and I’m still in awe of your beauty inside and out. I still remember and cherish the “at least I’m holding onto you” piece story, that you’ve been waiting to finish that piece when that special someone steps into your life. My heart burns with passion and love for you, only 22 more days until I see you love 🥹🩵",
            "date": "July 4"
        },
        {
            "author": "Zac",
            "text": "Good morning, my love 🩵 I hope you are ready to face the day with the strength and joy that God provides. I thank the Lord every day for blessing me with you. Even though we are miles apart, my heart feels your presence close. A verse from a devotional I read today, know that I’m not alone in loving you, God’s love and faithfulness is present forever and always, and I strive my best to keep that promise to you too 🥰🩵 “The LORD hath appeared of old unto me, saying, Yea, I have loved thee with an everlasting love: therefore with lovingkindness have I drawn thee.” (Jeremiah 31:3) May your day be filled with His peace and grace. I love you deeply and can’t wait to be together again 🙃",
            "date": "July 5"
        },
        {
            "author": "Zac",
            "text": "Good morning my love, I bet you look cute while sleeping right now 🙃 I’m so grateful for you and I’m excited to get up every morning because I’ve got my soulmate, I feel complete. Your compassion and faithfulness inspires me and I’m incredibly proud of the woman you are 🩵 Here’s a Psalm to remind us of one of God’s promises “This is the day which the LORD hath made; we will rejoice and be glad in it.” (Psalm 118:24) May God’s blessings and joy fill your heart today. I love you and miss you more than words can say ( ^ω^ ) 💙",
            "date": "July 6"
        },
        {
            "author": "Holleigh",
            "text": "I’m so thankful for you Zac🩵 I mean it every time I say it, I am in awe of you and just so so thankful for you and all you do for me. I never knew a love like this existed until you came along. It’s so hard being away from you but I’m so insanely lucky to have someone that makes being away so hard💙🩵 You are my dream come true, my answered prayer. Someone I didn’t know I needed until you came into my life. You’ve shown me a gentle and quiet love, a Godly love. You’ve shown me that love doesn’t have to be this grand thing, but love can be in the little things and quiet moments. I love you for all that you are, all that you’ve been, and all that you’re going to be🩵 I can’t wait for the day we tackle the distance and won’t have to say goodbye, only goodnight. I love you and only you, I have found the one whom my heart desires and it’s you. In every lifetime it’s you. I love you with everything I have🩵 I’ll continue to shower you with love and affection until I’m 6 feet under. I love you, the love of my life, my soulmate, my person, my future husband💙",
            "date": "July 6"
        },
        {
            "author": "Zac",
            "text": "You are the person I have longed for all my life, a divine gift from God Himself. What we share is a truly beautiful and extraordinary bond. We are destined to be the couple everyone looks up to, a testament to love’s enduring strength. It won’t always be easy, but I have never shied away from a challenge, especially one so worthwhile. You have complemented me in ways I never imagined, transforming my life into something profoundly wonderful. It is your unwavering love and support that have made this possible. Every little act of love from you is noticed and cherished, more than words can express. From the bottom of my heart, thank you, my love. And thank God for us; all glory to Him. You said it best: the pain of separation stems from our unbreakable bond, a bond that distance can strain but never sever. This hurdle, we will overcome, no matter what. I promise to stay by your side, to bring out the best in each other until the very end. I love you with every fiber of my being. Yours forever 🩵",
            "date": "July 6"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love🩵 this was truly beautiful to read this morning!! You’re the man I’ve prayed for since I was little, and to see God granted me my prayer, everything leading up to you is worth it. Distance won’t ever be a factor too difficult to overcome, you are worth the miles between us. You have definitely complimented me in more ways than one. In ways I never knew could be possible. Your intentionally is shown through so many aspects in this relationship. I’ve never experienced love like this, and you’ve completely changed my view of it for the better. I thank God for you every waking moment, not able to comprehend that He gave me you. Distance isn’t forever, I have faith in Gods plan. We were brought together for a reason. Even though it’s tough and it hurts sometimes, it’s all going to be worth it in the long run. The distance is temporary, a love like this is rare. I’d spend the rest of my life in long distance if it meant one day I’d get to be by your side. I promise to stay by your side through it all. The ups, the downs, good, bad. No matter what life throws at us. I am committed to you 110%. I see my future with you by my side, only you as my partner and soulmate. I’m yours, only yours 🩵 I hope you have a wonderful day today, I pray you slept well and you have a great service this morning and a wonderful picnic with your family this afternoon !! I love you so much💙",
            "date": "July 7"
        },
        {
            "author": "Zac",
            "text": "Woke up early and I got you living in my mind right now, so I might as well say good morning 🩵 I wanted to say I’m so thankful to have you in my life. I’ve been meeting with cousins and their significant others on this trip and I’ve just love yapping all about you to them, even talking about our future when the conversation permits it. It’s been so great, and on the Lord’s day today I thank him and appreciate all he has blessed us with in life, specifically our relationship. I also really want to thank you, the sun that lights up my soul, for being so kind and affectionate to me, I’ll forever repay the favor because you deserve it. In your dark, soulful eyes, I see my whole world and more. Thanks love, have a blessed Sunday filled with rest and God’s peace and reassurance. Enjoy the beach trip, I look forward to seeing pics of it 🌹🩵 I’m going to try to head back to bed and get more rest, love you!",
            "date": "July 14"
        },
        {
            "author": "Holleigh",
            "text": "I love you so much🩵 I don’t ever think I’ll be able to express the words of how much I love and adore you , but I’ll spend the rest of my life trying to find them. You are my love, my heart, my light. You bring a smile to my face all the time, I see you in the ocean and the sunsets. My face lights up when I see your name pop up on my screen. You make me so happy, I’m truly in awe of you and so blessed God gave me you🥰💙 I love you with all that I have, always and forever my love",
            "date": "July 15"
        },
        {
            "author": "Holleigh",
            "text": "HI MY HANDSOME MAN🩵🩵🩵 It’s OFFICIALLY 12 AM where I’m at- so it’s been 3 MONTHS WITH THE LOVE OF MY LIFE🥰 My person, my soulmate, my lover, my future husband !!!!! I’ve known you for 6 months, loved you for 3🥰💙 Zac, it has been such an honor to get to love you these past 3 months. You are the epitome of a Godly man. You have all the characteristics and attributes of a Godly man, and everything and even more that I’ve been praying for since I was a little girl. You are so compassionate, intentional and caring when it comes to me. You aren’t afraid to be obsessed and loving with me in public in front of others. You love me so well. You are a dream come true my love. It feels like I’ve known you way longer than 6 months!!! I’ve always seen this quote going around, and now I understand it completely. “Love someone who makes you love Jesus more” Zac you embody Jesus’ love for me and to me. You truly are a work of art. Words won’t ever be able to express how much you mean to me. These past few months with you have been unforgettable. I’ve enjoyed each and every moment with you. Whether that be over the phone, in person etc. every day with you as an adventure, our adventure. Loving you is the greatest adventure.🩵 I cannot wait to see where God brings us and what He does for us! You are my answered prayer, my lover, my future husband, my everything 🥰 I love you to the moon and back and past the stars my love!!! Happy 3 months!! We have forever to go! 🤍",
            "date": "July 19"
        },
        {
            "author": "Zac",
            "text": "During my hockey game tonight, I knew I was going to be blessed with a lovely 3 months message, because that’s the thoughtful, dedicated, and loving person you are. I couldn’t help but smile on the ice and on the bench. What I didn’t expect was another stunning piece of art. You never cease to amaze me my love, the fact that you found time to draw this delightful piece while at Myrtle Beach made yell in surprise when I opened my phone in the car. The daisies all over such a heavenly scene. The lighting on our sonas bodies and hair. The flowers I wish I could pick for you in my sona’s maw. The rolling hills and their content expressions, I’m sure they feel at home. Thanks for the songs to listen to on the ride back too, I had a smile plastered on my face. Holleigh thinking back on this year, it feels so it’s been so much longer than it has. We’ve grown so close together at an incredible pace, I’m so proud of us, we’ve gotten through some difficult conversation and came out even closer due to it. I have an unwavering trust and respect for you, I will never back down from a difficult conversation, we’ve shown to flourish past anything like that. You’ve taught me how to love, I didn’t think it would come so fast, but I’m ready to go where it takes me. I’m ready to marry you, I promise. I know it will happen. I big part of my anxiety getting into relationships was that my partner would desert me when times get hard, it was hard to put myself in someone else’s hands so that they could have the power to throw me away. With you I see my whole life, your perseverance shines bright and it encourages me. I know you’d never leave me, and I will never leave you. God has given me the most precious woman I can ask for and now I get to enjoy life with her, how unbelievable is that? I cannot wait to put a ring on your finger. I love you endlessly and I’m thankful for you more than I could ever say. God’s response to my prayers last year has never been clearer. You’re the answer my wife 🌹",
            "date": "July 19"
        },
        {
            "author": "Holleigh",
            "text": "G’Night my love!! I love you so so much!!! Sleep whale and sweet dreams !!!🩵 I am so deeply INLOVE with you🥰 I said “I love you” but what I meant was - I’ve never felt so much peace with another person. I can rest my mind and speak my heart for the first time without feeling judged or unwanted. I feel safe with you. I feel known. And for the first time I understand what real love is. You were the first person I felt both wildly unsure and unwaveringly certain of. That was the scariest part about falling for you; the fact I had no idea what I was doing, but at the same time, I knew exactly why I had to. You are the proof God answers prayers🩵 it felt easy, like God had put the two of us together deliberately. I love you my handsome man, I can’t wait to talk to you and hear all about your trip!!!💙💙",
            "date": "July 20"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!🩵 I hope you slept well and you’re well rested for today!! Happy Monday !! Only 2 MORE DAYS until I get to see you!!!!🥰 I am truly so blessed beyond measure. You are my answered prayer in so many ways love. In you, I have finally found all I ever never dare dream I could deserve or have- the kind of love that is rare. Being known in a way that touches the deepest parts of me. Accepted in a way that blows my mind. In you, the love I have always desired to give now has a place to call home. I have been a skeptic, but you are my undeniable miracle. I am yours, the way the sea belongs to the moon, the way the moon belongs to the sky, and even if jealous stars break and shatter upon the Milky Way, I will still see heaven in your eyes🤍 It’s an honor to love you and to be loved by you Zac. Here’s to forever🩵💙 I love you so much",
            "date": "July 22"
        },
        {
            "author": "Zac",
            "text": "Good morning my gorgeous princess of a wife 🩵 It was a little bit of a rough sleep without you by my side, but I’m blessed to be able to sleep in. I pray you’ve had a good night’s rest and you are ready to take on what the Lord has in store for you today. It was a pleasure to read your text as I get up today, such beautifully written words of romantic encouragement, I appreciate you so much. I’m floored that you are real, that I get to be your person, that I can love you forever, and just enjoy being with my best friend at the same time. Your beauty shines through all of your features, your sweet smile, your smooth skin, your deep tan which I’m ecstatic to see in person, your adorable giggle. I’ve fallen in love with your soothing southern voice, just hearing you talk warms my soul, your dark eyes which I get lost in and cannot wait to gaze into in two days. Even without painted nails, styled hair, and makeup, you are the only one I ever desire, but I see and appreciate any effort to make you glow even more, it’s like icing on top of a cake. I love you for who you are and I always will. Don’t change for anyone, I love you dearly 🩵 Thanks for being my wife 🌹",
            "date": "July 22"
        },
        {
            "author": "Holleigh",
            "text": "This made my DAY my love🥰🩵 I’ve read this about 10 times now🥹 I’m so blessed by the lord that He gave me you Zac. You are my everything, my answered prayer, the one I want to spend the rest of my life with forever. I love you always and forever my future husband🥰🩵💙 I can’t wait for forever with you!!!!! I’m so in awe of you, and your fire for the lord and your love and adoration for me. Never in my life did I know I’d find my dream person, and God graciously put you in my life. Words won’t ever be able to express how much love I have for you. I love you so much, always and forever",
            "date": "July 22"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!!🩵 I hope you’ve slept well and you’re ready to take on today!! Happy Tuesday!! Only ONE MORE DAY!!!!! 💙💙💙 I pray today is as great as you are and you are productive and successful in all you do today!! The Lord is always beside you and guiding you! Remember to lean on him. He is so good and so gracious to us !! Praise him for allowing us to wake up this morning! I’m so proud of you. You are achieving so much and you are doing so many amazing things and are going to do amazing things and change the world in the future !! It’s an honor to love you and stand by your side. I will forever cheer you on and support you in your dreams. Achievements and your goals. You can do anything with God by your side ! I love you so much my love!! Only a few more hours till I get to hug you!!",
            "date": "July 23"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my handsome lover🩵 I hope you slept super well last night and were able to catch up on rest!! I pray today is as amazing as you are!! Happy Tuesday!! I love you so much Zac, I knew you loved me when I could feel it in the way you listened, in the way you remembered the “just because” gestures. You accepted every corner of my life, even the parts that collect dust. I knew you loved me when you showed me how far you would go, you sat next to me patiently as I unraveled and rebuilt who I wanted to be. I knew you loved me when I realized that I had never been seen before. There was no n facade of expectation. You intertwined your life in between my lines. This was lightweight. This was we will figure it out together. This is home, but in a person. I knew you loved me, because I never have to wonder if you did. Your love is kind, gentle and pure. And it lingers on the small wounds and scars that have tainted my heart, I realize just how much I have endured to finally be healed and loved by someone like you💙  I want to make up for all the love you never thought you deserved. You are my answered prayer, each day is a gift, a reminder of the Lords goodness and faithfulness. I love you with my whole heart Zechariah Christopher Yurkanin. You are the only one for me. I’m yours as you are mine. Gods plans for us will be a beautiful love story🤍 I can’t wait to see how it turns out",
            "date": "July 30"
        },
        {
            "author": "Zac",
            "text": "Thanks so much for this text to wake up to ☺️ I appreciate the effort you put into it so much, it’s so beautifully written and packed with love 🩵 It means the world to me that you’ve been able to open up to me and put your trust in me relatively quickly. You’ve healed faster than I’ve ever anticipated, at first I didn’t understand how deep the scars were, but knowing what I know now I’m surprised you gave me a chance, a stranger living in Arizona. Over five years of that and we are just over 3 months together. I knew before I even talked to you that you were special from what you posted on twitter. Not just the art, which signifies dedication and passion and reflects God’s glory through beauty. The God fearing part of you shined and shines so bright. And that was all before I had even met you, you are the sweetest, most thoughtful, loving, compassionate, and strong woman I could have ever wished for. I would have never thought you hadn’t been treated with decency in the past. You are deserving of abundant and profound love, and I promise you I will spend the rest of my life giving it to you. Let’s live our romance movie forever 🩵 I love you 🥰",
            "date": "July 30"
        },
        {
            "author": "Zac",
            "text": "Good morning my love 🩵 happy national girlfriend day to the woman of my dreams 🥰 You are the only person I ever desire to marry and I can wait to be able to celebrate national wife day 🙃 I pray you got good enough sleep to make it through the day as you start heading to your cruise, and that your family enjoys a time of tranquility on the ocean without quarreling. I’m so thankful to spend life with such a beautiful woman inside and out. I love you more than anything, second to the Lord 💙🌹 I miss you dearly, especially after I dreamed about you last night. There was us and two friends, on guy and one girl. The girl friend was a furry artist and everyone wanted to date her cause she’s single. You both counted up your dog/wolf drawings to see who drew more of them and you won. Our guy friend was moving into a new house and I asked him when we could come over and have dinner, he said February 11th, but that is my brothers birthday, and I think you said Noah had something on that day too. It ended with you sketching all of us together. I just enjoyed your presence but I woke up and realized you weren’t here 🥲 In the dream you had planned to visit again soon.",
            "date": "August 1"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!!🩵 happy FriYAY !! I’m so glad your hockey game went well & ya’ll won!! So so proud of you!!🥰 I hope today is a great day!! I love you so insanely much. I’m really missing you a ton right now😭 wearing your jacket brings me so much comfort & peace. Thank you again for letting me bring it home🥺💙 it makes it a bit more bearable being away from you. I pray you get enough rest, I saw you were up at 3AM?? That’s crazy😭 I love you so so so much my partner in crime!! It’s us forever🥰🤍 God knew my heart needed you and I will forever be thankful for that. Everything is better with you. Everything has been better since you🩵 I want to spend the rest of my life learning all the ways to make you feel loved. I love and cherish you always my love🥰",
            "date": "August 2"
        },
        {
            "author": "Zac",
            "text": "Good morning 😁💙 you’ve had a very early day lol, I’d be surprised if your family doesn’t get sleep deprived Holleigh. It means the world to me that you’d wear my jacket around, I LOVE YOU SO MUCH 🩵💙🩵💙 I’m so thankful for you and I know it’s only by an act of God working through me that I found such a wonderful person online and reached out at such an opportune time 🙃 You are deserving of love from me forever, no matter what comes in our way. I’m incredibly proud of everything you do, from posting Godly messages like the one you posted on instagram today to your works of art which show you make magic :) Thanks for treating me with such love and being so joyful no matter the situation, being around you for the rest of my life will be like living a dream. I miss you so much, but I’m elated to just have you in my life and look forward to every text and call from you. Distance means so little when someone means so much 💙🌹",
            "date": "August 2"
        },
        {
            "author": "Zac",
            "text": "Good morning my love 🩵 another day passes, meaning we are another day closer to our future together. It’s a wonderful Sunday, I’m going to spend time with the Lord today, and I pray that you are able to find peace in Him for some time today, as I know the cruise can be hectic. Today I look at us and I realize again how proud I am that you were able to burn the ships of your past and trust in me, and more importantly in God to lead you into a relationship with me. The scary prayer you prayed worked out perfectly, I know it must be hard to put that into God’s hands and trust him with it. Thanks for stepping faithfully into my arms babe, I promise to be there for you forever, you beautiful breath of fresh air 💙🌹",
            "date": "August 4"
        },
        {
            "author": "Holleigh",
            "text": "G’Night my love🩵 I hope hockey went well tonight! You are so talented and amazing at what you do :) I’m proud of you. I hope you sleep well and get enough rest for tomorrow!! It’s another week we get to show Gods glory to others. I’m lucky to love you and get to do life alongside you! You’ve changed my life for the better, added color to my blank canvas. Brought the blue back into my oceans and my skies. You are my sunshine ☀️ I know life with you will be a dream. A reality we get to live together 💙 I love you, we have forever to go🩵💙 always remember, my heart holds you when my arms cannot. You will always be the love I call home",
            "date": "August 4"
        },
        {
            "author": "Zac",
            "text": "Goood morning my wife 💙💙 I know I can’t roll over in bed to say good morning to you in person but getting to text you first thing in the morning is the next best thing. I slept well and I’m ready for the day. I pray you have a restful Sunday and you enjoy the day, spending time in God’s presence. He gave me you and I’ll never let go. I love you so much, I’ll spend the rest of my life trying to express it. You are the most important person in my life besides God. Thanks for playing into the pit with me, I loved every second of playing it with you. My face hurt after that night, I couldn’t stop smiling at every little thing we said, from the playful jokes and jokes that had discord server implication, to getting to call you my muffin to say good night 🥰",
            "date": "August 11"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love🩵 I hope you slept well and got enough rest!! Happy Saturday!!! Thank you for an amazing night last night. It was truly a dream come true. Watching you play RUIN & hearing you theorize about it was truly awesome. I never thought I’d find someone to share these passions with. Thank you for choosing to love me even through distance. I know some days can be extremely tough, I’m thankful for your unwavering faith and trust in me to do long distance. You are my answered prayer, my miracle. I never knew a love like this existed. You’ve shown me what true, Godly love is. You are my sun on the cloudiest day, my joy in the tough times. What an honor it is to love you and be loved by you🩵🩵 you’re my forever. I want to grow old with you, my bestfriend. I love you forever and always, till death do us part. I hope you have the best day, may the Lord speak through you and use you to shine His light and get his message to those who need it!! You are truly amazing. I’m so proud of you",
            "date": "August 17"
        },
        {
            "author": "Zac",
            "text": "Goodnight, sleep whale! 💙 I’m seriously speechless as to how lucky I am to live with you in my life. The fact that you sit there with your full attention when I’m playing FNAF and catching up to you in the lore is something truly special. You sit there engaged and support me, calling me the most adorable names :) Even when I complete some simple games, you smile and spread positivity and I just can’t help but feel so warm inside. You bring a smile to my face in everything you do. I make a little heart in my hands and you do it back every time. I love you Holleigh, with my whole heart, body and soul, and I promise on everything I have that I’ll will never step away from you. God shines through you in everything you do. Get some rest babe, my wife, my love, my soulmate, my dear, whatever name you fancy 🥰 My tail wags for you endlessly 🌹",
            "date": "August 17"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!🩵 this was so sweet to wake up to🥺 I would watch you play FNAF & catch up on the lore any day, anytime🥰 you are deserving of love and I’ll spend the rest of my life showing it to you, you are my blessing💙 I cannot believe I have someone to share these passions with. Everyone thought I was weird for liking FNAF, and all these other things, but with you I can embrace them. You took my hand and jumped into the madness with me, wanting to watch all these FNAF Theories and play the games with me. No ones ever wanted to do that, no ones ever wanted to learn and go that far for my interests. I’ve never had someone put that much effort into me besides Jesus. Zac you truly are someone so special and precious to me. Your smile makes my entire day, to hear you talk about your passions and your ideas is so amazing, your Ghostern story is beautifully written. You have so many amazing ideas and I know you’re going to do great things!!! Zac I love you with all that I have, I promise to stay by your side till the end. You’re the one I want and choose to do life beside. God put you in my life for a reason, at the most perfect time. Looking back, I can’t imagine my life without you now🩵 I love you I love you, I love you SO much💙 till death do us part",
            "date": "August 18"
        },
        {
            "author": "Zac",
            "text": "I pray your sweet dreams are coming along my sweetest wife. The best four months of my life, thanks to you. Four months of seeing your precious smile. Four months of waking up to some of the most thoughtful and loving messages I’ve ever gotten. Four months of FNAF, MatPat, and our giggles in the night. Four months with not enough hugging and kissing than desired, but enough to last me a lifetime of waiting for the next time. Four months since stepping into a forever relationship with my Proverbs 31 woman, precious as rubies, even more so… I’ll marry you, as a life without you would be like missing the train to my dreams becoming a reality. Here’s to the rest of our lives. Lives with perfect communication necessary to navigate the bumps in the road. Lives with faith that can move those bumps, no matter how big the mountain. Lives filled with facing and overcoming problems. Lives filled with love, not the kind you fall into, but the kind you cherish and kindle so that you look back upon it and are proud. Lives of bringing life into this world, nourishing and caring for God’s greatest gift. God’s got a life of surprises lined up for us, let’s accept each one with open arms. I love you my love, I adore you and I’ll remind you more than the stars in the sky. I’ll kiss you more than the grains of sand. I’ll hug you until every hint of stress, sadness, and anger leaves your body. My one and only, forever and always. Happy four months 💙🧡❤️",
            "date": "August 19"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!!! Happy 4 months!!!🥰 I slept super well praise the Lord!! These have been the best 4 months out of this whole year. Praise be to God for placing you into my life !! Four months of learning, loving, FNAF and so many fun memories with you!!! I’m truly blessed to be with someone so caring, compassionate, loving, thoughtful and Godly. I’ve prayed for you for years and to see it granted was a testimony of Gods goodness and grace! He truly is a good good God!!! I’m forever SO incredibly thankful for you Zac, you’ve shown me what a healthy, Godly love looks like. Something I thought I’d never be able to experience. I love you so so much, my bestfriend, my partner in crime, my lover. Happy 4 months, we have forever to go 🩵🩵🩵",
            "date": "August 19"
        },
        {
            "author": "Zac",
            "text": "Good morning my gorgeous president!! 💙 I pray you got good sleep for your second day of school. I didn’t get to dream of you last night, but yesterday was a dream just getting to spend time with you and play FNAF while you were drawing. My body decided to wake up at 7:30 again even though I was up late due to hockey last night, so I think I’ll get up soon if I don’t fall back asleep. It’s okay though, maybe God is trying to get us on the same sleep schedule 😌 Today let’s push our burdens over to God, let’s not let stress and worry bother us when we are doing our best. I love you so much, and I know you love me too, you do such a great job expressing it daily. I’m proud to call you my future wife 💙",
            "date": "August 20"
        },
        {
            "author": "Zac",
            "text": "Truly I tell you, I want to be the only one who has to see Holleigh behind the scenes. I want to be the one to mend you when God sends you to parts and service to be rebuilt after the worst. I want to spend my nights recharging you so you can go out there and keep your joyous attitude and change lives, bring others to the Lord. It means the world to me that you’d even consider being vulnerable with me because it shows the ultimate act of trust. Trust that I will support your weak points rather than take advantage of them. On days when that beautiful smile fades and it becomes hard to stay joyous, you don’t have to pretend to smile. No need to drain your battery further, I won’t run away if you aren’t your smiley, positive self all the time. On the worst days I will be around for you to just lay in my arms, no words needing to be said. Romance movies don’t show it, but behind the romance are days of recharging scattered amongst days of hard work. There will be busy times in life and I’ll enjoy those knowing that patience will bring times of tranquility. I feel like this is almost God’s test for us, can we make it through the tough times without even being about to hug each other? I know we can, with someone as strong as you by my side, it will be more than possible. God is here too, I’m always reminded of Ecclesiastes 4:12 (KJV):“And if one prevail against him, two shall withstand him; and a threefold cord is not quickly broken.” That’s us babe, us and God. I love you",
            "date": "August 21"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my handsome man!!🩵 I love more!!! Of course!!! I loved it :)) tonight was what we needed after this week!! We definitely should have like a chill night or movie night every weekend if we’re able!! I’m truly lucky God gave me you. You are everything and more I’ve ever prayed for in a man I’ve wanted to be with. You are an answered prayer. I know this week was a bit hectic, but thank you for staying with me even through the business. Thank you for wanting, and taking time to talk through our concerns and the things that bother you. I never knew a love like this existed outside of God. I was lucky enough God sent me someone who loves like Him. I love you Zac, thank you for loving me🩵 you are my greatest adventure! I can’t wait to see where God takes us in life!!! I hope you’re feeling a bit better today!! If not, please maybe go get checked out. Your health is important and being sick isn’t fun :( I care about you, I love you!! I pray today is a wonderful day!! 🥰💙",
            "date": "August 24"
        },
        {
            "author": "Zac",
            "text": "Good afternoon my wife ❤️🧡💙 I slept really well and I feel great!! I hope you’ve gotten rest too, yesterday was a long day. Honestly this is reminding me how perfect the timing was to reach out to you and meet you in January. I caught you right before you headed to Auburn, and I know if I reached out now it would have been very hard for you to get time to meet me. I’m so happy I have spent these months knowing you Holleigh, you are so incredibly special. Over 8 months later and I still just sit here smiling, looking through pictures of us, your art, and everything I’ve pinned on my wall, and I’m consumed by adoration for you. I love you so much, and I’m so proud of you, and us for the relationship we’ve built so far. 💙",
            "date": "August 27"
        },
        {
            "author": "Zac",
            "text": "Perspective is everything 😌 Your positive outlook is one of the top things on my list for my wife, but you really do check that list from top to bottom. We are the stars in the night sky, aligned perfectly from the culmination of our pasts until now, I could not be more pleased to be in your company. That picture of you is beautiful, not just because my beautiful wife is in there 🙃 but the backdrop you made is an extension of yourself. It’s poetic in a sense, I look at your stance and at the colors you’ve painted, and I see those colors in you. The bright orange is the first ray of sunshine that finds its way through the stormy clouds, your positivity finding its way amongst the dark sky. The blue is the vast expanse of the sky, while I’m in love with the color in itself, the sky is what fills the empty space amongst the clouds. You fill other people up when they are missing something in their lives, and I’m certain that’s God working through you. The pink and yellow remind me of the feeling I get being around you, and I know others do too. Pink is the love I feel when you do any little thing for me, yellow is the joy that fills me when you even just smile, the flower blooming within me tended and cared for by you. To see my love standing among the backdrop that she created, I see the mascot to a sorority of wonderful women. I’m so incredibly proud of you so far. I’ve said it before that you are enough, but you are more than enough dear, you are what I’ve been praying for, and I’ll marry you. Now I do want to mention that in days of distress and turmoil, that I will promise you to be there for you the most. After everything I’ve just said about you, it’s okay need to recharge on a bad day. You don’t have to be like this 100% of the time around me, I’ll be there to hold you tight in my arms and not let go until you are ready to spread your joy around the world again. There will come a day where you or I will need just that to recuperate, it’s harder since I’m across the country, but God’s got us. I love you and I’m here for you through it all. You’re the one for me forever 🌹 I hope this has been nice to wake up to!! Don’t bother writing a giant response back my love, let this message help you get through your last day until the weekend! 12 more days 😌",
            "date": "August 30"
        },
        {
            "author": "Zac",
            "text": "Hey my love, I’ve been reading a bit about the honeymoon phase and I’m seeing some people who claim to still be in it after being together for years. I don’t know if they are telling the truth or if they misunderstand what the phase is, but it does make me sad thinking about if or when ours will end. I just wanted to say that right now I’m infatuated with you, to call and see your face has me on cloud nine every time. Hearing your voice and seeing that friendly smile is a joy I’ll never get tired of. I feel like I’m sailing away on a boat with you, and no matter how rough the waves are, I know I will always be at home by your side. Yeah maybe that obsession will end one day, and I’ll finally be able to do anything without thinking about you the whole time. But I wanted to type this out to promise you to keep on putting effort to make you feel those butterflies and warm feelings as much as I can, forever. I promise to send texts like these, but when we live together, they will probably be in the form of letters to you my love. I promise to spoil you with thoughtful gifts like gift art and plushies, in the future this might look like surprise trips to places of your dreams too. I promise to always tell you how proud of you I am, to support you on your worst days, to tell you how you are the woman of my prayers and dreams. This won’t change, but you’ll be able to rest in my arms when I say these things in the future. I promise to spoil you with little acts of service, i haven’t been able to do that too much because we are so far away from each other, but i look forward to it! And of course our quality time will never leave. I promise to be present with you and enjoy our time together, and I will ALWAYS ask you about your day and never get sick or tired of hearing you tap about it. You are my favorite person, and any time spent with you is a wish come true. I promise to always make an effort to hug, kiss, hold your hand, just giving you all the physical touch you could ever want. Right now I don’t know how I would ever get sick of it haha, but I promise to put an effort into anything to make you smile. Most importantly, I promise to put God and His will for us in the forefront of everything, forever and ever. I don’t know what came over me to type all that, maybe it’s me missing you, maybe it’s reassurance that you never stop feeling the sweet feelings that come with the honeymoon phase, but I know for sure it’s what the person who I will love and cherish forever deserves. I love you Holleigh, forever and ever ❤️🧡💙🌹",
            "date": "September 8"
        },
        {
            "author": "Holleigh",
            "text": "My love🥹🩵 I know some people stay in that honeymoon phase even throughout years, even decades of being together! I’ve seen countless videos and heard from couples about still being madly in love and obsessed with their partner! I think especially for a biblical relationship it is possible! As long as God comes first & spouses second, God will bless the marriage & love! Reading this genuinely brought tears to my eyes. I’ve re-read this message, your declaration of your love, your promises to continue on even if that does fade. It’s so astonishing and truly so heartfelt. I never imagined a love like this, you love me so intentionally, you put your heart and soul in everything you do, say and act for me; for us. This has truly made the biggest smile come on my face, and my heart grows even more in love with you, which I don’t know was possible. Zac, you have shown 1 Corinthians 13:4-8 love continuously. When I replace the word love with your name, you are in that verse. Your love for me is so great, I never imagined God would see fit to give me someone so precious, so intentional. I promise to continue to show you all the 5 love languages, no matter if we’re old and grey, it brings me countless joy getting to see your smile and hear the excitement in your voice. I will never grow tired or weary hearing about your day and the fun adventures you’ve been on, and all the so cool projects and things you’re getting to do. Zac, you are more than my answered prayer. I’ve prayed and talked to God about you for years now, not knowing it was you I was talking to Him about. He knew, God knew what He was doing when He gave me you. You are the best role model as a Godly man and a Godly relationship, and what true love looks like. Everyone you meet when you’re down here visiting will be astounded by your humility and humbleness. Your selflessness for me and for us. Reading this is just a reminder for why I chose you. I promise to love you with all that I have. Lord willing, I want to be the one to wake up by your side every morning, and come home to each night. You have truly given my life so many wonderful colors, shown me what love looks like and what it can look like as long as we live. I love you so so endlessly my love🩵💙 I won’t ever grow tired of loving you, showering you with love, words of affirmation, gifts, physical touch, quality time or acts of service. I thank my God for you every single day. I love you Zac, you truly are my miracle I’ve been waiting on for🩵 you will always be worth it. I’m so honored God gave me you",
            "date": "September 8"
        },
        {
            "author": "Zac",
            "text": "Wanted to quickly say happy 5 month anniversary before going to sleep my love 💙 This year has really gone by so fast looking back on it, but it feels like I’ve known you forever. You will always be more than enough for me, I have no want for a life without you. I will never leave your side, and will fight for us no matter what comes our way. Every day my passion grows for you. I’m so proud to see all that you have accomplished while being in my life, your art, your Biblical posts, your Bible and devotional reading and overall immersion in the word and presence of God, and your thriving sorority through which you make every member’s life better. I am complete in God, but you complement and enhance me. I love you eternally ❤️🧡💙",
            "date": "September 19"
        },
        {
            "author": "Holleigh",
            "text": "Happy 5 Months to my bestfriend, my confidant, partner in crime, soulmate, my lover, my person. To know you is to love you. Knowing you these past few months has been the greatest adventure. Zac, you are everything and more that I’ve been praying for in a man. You love me so well. I remember when you first reached out to me, you were so inquisitive about me, my life and were curious to what I had been up to. You showed your authentic self from the start, and have stayed true to you ever since I’ve known you. It was definitely that smile, the first time I saw it. I knew I wanted to see it for the rest of my life. You have shown me what love is, healthy love. You have had patience with me when battling my past, when we have any bumps in the road. You ease my worries constantly, never have you given me a reason to doubt or not trust you. I had been praying for you for years, not knowing God had you right where you were supposed to be. You inspire me, you keep me grounded when I need it, offer a listening ear, a gentle smile and your warm laugh. I couldn’t imagine my life with anyone other than you, you are a breath of fresh air. The sunlight on my skin, my flowers in a field, the fire that keeps me warm on a cold night. You’re a love I’d cross oceans for. Zechariah Yurkanin, I will forever be thankful God saw fit to place you into my life. I can’t wait to see all the adventures we get to take on, I love you always and forever 🩵 Happy 5 months my lover. You are proof that God answers prayers 💙💙💙",
            "date": "September 19"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!🩵 Happy Monday! It’s the beginning of the week! Which means a week full of possibilities, ways to show Gods love & spread His word!! I’m so thankful for you Zac. I know we have conversations that aren’t fun sometimes, and I’m really thankful for you that you talk through everything with me and we can get through the tough conversations together. That you actually want to talk about it and through it, and you don’t sweep these things under the rug! I love you so so so much🩵 I’m so thankful and grateful to call you mine, you are so patient, loving, caring, and truly a blessing in my life. I love you Zac, and I’ll love you through the good days & the bad, and through the uncomfortable conversations! I love you so much. Thank you for choosing me & choosing to love me💙",
            "date": "September 23"
        },
        {
            "author": "Zac",
            "text": "Good morning though my love !!! I hope you’ve slept well, I’m sure you were exhausted from the not so relaxing weekend and getting up this morning was probably pretty difficult. We are a team and you are the best teammate I could ask for. What we have is worth every difficult conversation, we have such a deep relationship and it’s only been 5 months. Keep communicating these things with me, every time we finish talking, I always feel a lot better. Sometimes I try not to bother you with those conversations, but every time I finish one I remember how easy you make it to talk to you. I love you eternally, you are a bright star in the dark sky, not only for me, but so many others. It’s funny how you are already Hannah Grace’s outlet to talk about her relationship, you bring wisdom to the table. Have a wonderful day 🙃💙",
            "date": "September 23"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love🩵 I’m so glad I got to hang out with you yesterday and la  at night🥰🥰 I’m truly so so thankful for you!! It’s so wild that God knew what He was doing all along, bringing us together. Two people who needed to grow in their faith and their relationship with the Lord before finding each other. I’m in awe of you, we have so many similarities yet we’re still different in our own ways. You compliment me so well, you bring out the joy, love, patience and laughter in me. Ever since meeting you my life has been more colorful and full of love than I’d ever imagine. I love you SO much🩵💙 always and forever 🥰 I hope you have the best day!!",
            "date": "September 26"
        },
        {
            "author": "Zac",
            "text": "Good morning :) This was a lovely message to wake up to 🥰 I feel so bonded to you it’s exhilarating, everyday I come something new that draws me closer to you, despite the miles apart. Even watching a simple YouTube video feels like a dream with you by my side. To know for all those years we had such similar interests despite completely different lives. I can’t wait to spoil you for eternity, you deserve every kiss, every flower, and every carefully crafted message. I’m so proud to call such a virtuous woman mine, even now I’m smiling cheek to cheek with coffee laying on my chest in my bed. I’d much rather you be the one lying on my chest, but the Lord has us where he wants us for now. I love you to Alabama and back a million times ❤️🧡💙 Good luck on your pamphlet today, I know it’s due!! Last I saw it looks so good, I can’t wait for you to show me it finalized XOXO I love you I love you I love you I love you I love you I love you !!!!!!!!! 🥰❤️🧡💙 🌹 flower for u!!! 🥀 it died 💔 💐 more flowers for u ❤️",
            "date": "September 23"
        },
        {
            "author": "Zac",
            "text": "Alex Warren - Heaven Without You I’m so glad I could make you feel loved, you are the most precious thing in my life so I’ll spend my days expressing that to you :) Same with being seen!! I’ll always make sure you are seen, and not just because you are something gorgeous to look at 😉 I see and hear everything you do and say, sometimes it leads to me reading into things to much, but most of the time I notice every little effort you make in all of your art pieces, the clothes you put on daily, the slightest change in jewelry. I hear your loving words and what’s on your mind, I could listen to you yap for days! Just listened to that song you sent me last night, it’s beautiful resonate with us truly :) Although I know heaven will be so much different than we expect, it certainly feels like you are my heaven. I can’t really imagine a world that gets any better than the one I’m in right now and it’s thanks to you 💙 The only thing better than this is getting to hold you in my arms, but God is working in us, there is reason. I know with Him in our sights before each other, we will be led to the greenest pastures with each other. I love you with all my heart, thanks for being mine ❤️🧡💙",
            "date": "September 28"
        },
        {
            "author": "Zac",
            "text": "Hey happy Gotcha day!! Your Gotcha day every year will be as important to me as it is for you. It was one very important step that eventually led me to you, the most important person in my life. While the Lord was at work, your parents also took you as their own. It’s a beautiful thing that the Lord orchestrated in so many ways, and another reason to praise Him on this day. You will always be my Russian princess, and I thank the Lord that he brought you across the world to grow up in Alabama, it’s a blessing to get to hold you in my arms. я тебя люблю 🇷🇺 🥹❤️🧡💙 Enjoy your gift :)",
            "date": "September 30"
        },
        {
            "author": "Zac",
            "text": "Good morning my love 💙 It’s more of a good afternoon for you, didn’t sleep great. I appreciate your message so much, I can’t believe I get to wake up to messages like this every day, I’ll forever be thankful. God’s timing was perfect, and my faith has never been stronger with you by my side. Today is going to be a wonderful day, no matter what happens, we can choose to see the light in every day. If nothing else, God gave us the Sun to rise in the sky without fail, and even that is enough reason to praise Him. “Some trust in chariots, and some in horses: But we will remember the name of the LORD our God. They are brought down and fallen: But we are risen, and stand upright.” ‭‭Psalm‬ ‭20:7-8 I love you to the Sun and back my love 💙",
            "date": "October 3"
        },
        {
            "author": "Zac",
            "text": "Good morning love 💙I hope you’ve slept great and you are ready for another week. Just think that when this week is over, we will be one week closer to being able to embrace each other. I’m so blessed to call you my partner in crime. I’m in awe of you, all that you are, and all the memories that we’ve made so far. Isaiah 41:10 (KJV): “Fear thou not; for I am with thee: be not dismayed; for I am thy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.” It may seem, even to me, that it is going to be very difficult to go even just a few weeks without each other. Thinking of God’s promise helps, He was there through our worst, and He is still here now. I miss you love, but we got this ❤️🧡💙",
            "date": "October 7"
        },
        {
            "author": "Zac",
            "text": "I hope your class went well my love!!! I haven’t gone back to sleep, just an early start to the day. Should help me wake up earlier to stay on your sleep schedule too :) I just wanted to remind you that you have complemented me in so many ways, I feel blessed beyond measure and I sincerely thank the Lord for you. No matter how your day goes, I just want you to know that you mean the world to me. I’m proud of you no matter what, your character is to be looked up to, and I know that when things don’t go your way, that you’ve put your love and care into all that you can. You are a blessing to your family, they are lucky to have you come home for fall break. To start a family with you is a dream, you will be the most Godly, attentive mother I could ever pray up, and I get a best friend out of it too. I love you dearly Holleigh, and I choose to love you forever.",
            "date": "October 9"
        },
        {
            "author": "Holleigh",
            "text": "This made me genuinely tear up🥺 I truly don’t know or understand how I got you in my life Zac. Each day I wake up in awe that I have someone as amazing, loving, caring, thoughtful, intentional and so Godly in my life. Since meeting you, you’ve helped make me a better person. You’ve shown me what true love looks like, what intentional, caring love looks like. I never in my mind thought I’d ever get to experience a bit of heaven on earth, and yet you came into my life🩵 Zac I am in awe of everything you’ve done and are able to do. You truly are a God sent miracle and blessing. I love you so much! I cannot wait to see what God has in store for our future!! We have forever to go!!!",
            "date": "October 9"
        },
        {
            "author": "Zac",
            "text": "Good morning my love, I hope you got rest and you finish your Minecraft cats if time allows it. I’m SO excited to see you finished work. I’m so blessed to have such a talented artist to enjoy spending the rest of time with. And that’s just the tip of iceberg with you, you make me feel loved in ways I have never felt in my whole life. I’m filled with joy always thank you so much my love. ”My foot standeth in an even place: In the congregations will I bless the LORD.“ ‭‭Psalm‬ ‭26‬:‭12‬ ‭KJV‬‬ Reading through some Psalms and this verse reminded me of you getting to go to the concert today :) it also serves as a reminder for me to bless the Lord. I miss you so so much, all I think about is getting to hug and kiss you all the time. Every time I visit you, it genuinely feels like it’s one of the best times of my life. I have so many amazing memories with you, from sharing laughs, embracing each other for hours and hours, and more 🙃. Just a little while longer wife.",
            "date": "October 12"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love🩵 Happy Wednesday!!! I appreciate you more than words could ever express. You truly are a blessing from the Lord in so many ways. I love each moment I get to spend with you no matter if it’s for a second or for hours. I’m so honored to call you mine and get to do life alongside you💙💙 You’ve changed my life for the better since I met you in January. I’ve found my bestfriend, my confidant, my lover, my partner in crime all in one. I love you so very much, I am missing you like crazy. I had a dream about you last night and I got to be in your arms again🥹 I love you Zac, I hope today is a wonderful day filled with Gods blessings & His love!",
            "date": "October 16"
        },
        {
            "author": "Holleigh",
            "text": "Happy 6 months my best best friend!!!🩵 I cannot believe it’s been 6 months of loving you!!!!🥰🥰🥰 It’s such an honor to have gotten to know you in the beginning of this year. I’ve known you for 10, loved you for 6💙 Zac, you’ve shown me what true Godly love is and I am forever thankful for you. You are the proof that God answers prayers. You are worth every mile between us. Long distance is so easy with you, you make me feel so loved and so valued even from across the country. I didn’t fall in love with you, I walked into love with you, with my eyes wide open, choosing to take every step along the way. I’d chose you, in a hundred lifetimes, in a hundred worlds. I’d find you and choose you. I never realize how much you felt like home to me until I found myself thinking about how much I wish you were here with me right now, thinking about how I want to experience every adventure of life I go through with you by my side. The saying “home is whenever I’m with you” has never been more clear to me. You are my home, and I am homesick without you. I love you so much, happy 6 months, we have forever to go! 🩵🩵🥰",
            "date": "October 19"
        },
        {
            "author": "Zac",
            "text": "Good morning my dearest 💙 happy six months!!! It has been an incredible six months my love, you’ve made 2024 a year to remember. Getting a fresh start together, loving each other from different worlds, has been what we deserved. Patience has been a big part of this relationship, 21 years you’ve waited for me, and 22 years I’ve waited for you. Even now we count down the days until we get to enjoy each other’s embrace. All of it was and is worth it, you are my first true love and you will be my only love. Thank you for teaching me about love, and what it’s like to live life loved, it’s something I never want to live without again. You’ve taught me not only how to love, but you’ve shown me it so well. My heart swells with joy daily, I’ve become addicted to you, and even after six months I absolutely can’t get enough of you. Learning to be romantic and show you my love has been a pleasure, and you have reciprocated me all the way. You are the masterpiece I have never known existed but always dreamed of. Getting to grow along side you has been the best, and I’m so proud of you every step of the way. My faith in God has never been stronger alongside you and nothing with get in our way as we cultivate a healthy relationship. Thanks for being there for our best romantic moments and our not fun conversations where we grow. 11 days until I come home, I choose love you for eternity, my beautiful Russian blessing 💙🥰",
            "date": "October 19"
        },
        {
            "author": "Zac",
            "text": "Under Auburn’s moonlit skies, you dance in blue, Dark eyes shining, like stars breaking through. While I skate on Michigan’s icy, bright stage, Facing battles and rivals, our love turns the page. I’ll think of you with each stride I take, Your strength in my heart, no fear can shake. Miles stretch wide, yet love knows no bounds, As you glide to the music, I skate these grounds. A prayer on my lips, a dream in my sight, Wishing I was there, holding you tight. For every mile, every state we’re apart, God keeps us together, in soul, in heart. So, tonight I play, and you spin with grace, Yet I see your smile, I feel your embrace. Six months gone, but forever to come, My beautiful love, my chosen one.",
            "date": "October 19"
        },
        {
            "author": "Zac",
            "text": "HI my lover, good morning 💙💙💙 I hope you’ve had a great start to your day so far. 2 more days, I’m so unbelievably excited, I really need this trip right now. Thanks you hanging out with me last night, and thank you SO MUCH for the Halloween piece. I love, adore, am obsessed with every piece you draw, I cannot express the gratitude I feel the need to express when you gift me one of those. I want to scoop you up and pepper you with kisses and squeeze you with hugs, anything to show my love for you. I’ll never get used to it, your art is as beautiful as you are. I cannot believe you are real. I love you 💙💙💙",
            "date": "October 28"
        },
        {
            "author": "Zac",
            "text": "Holleigh, thanks for those five days, they were absolutely amazing. I’ve never felt more peace at someone’s side. Every second is so enjoyable with you, you are my best friend and lover all in the same and they complement each other like no other. Even in the dull moments, joy fills my heart, I’m ever blessed to have you and I won’t get over that feeling. Thanks for driving all the way from Auburn and picking me up from the airport with food packed for me, I appreciate that so much. I’m thankful for our sweet tooth chemistry and getting to eat your freshly baked cookies and cinnamon rolls. Thanks for making plans for us, but not being overbearing about them. It warmed my heart when you were willing to pass up on the opportunity to dress up together for Halloween just to appease the black cat in me. I can promise you that I will always be more than happy to make memories with you even if it means being a little uncomfortable. Thanks for arranging our costumes and buying my outfit, we looked so good together and it made for a wonderful first Halloween with my soulmate 💙 Thanks for taking me to the Auburn football game and holding my hand while we boiled under the sun. Thanks for spending 25 dollars to watch the Wild Robot with me, it was touching to watch an unconventional family of a robot, a fox, and a bird together and it reminded me of us in a way, from much different backgrounds and across the country from each other. Thanks for watching Spirited Away and Totaro with me, as strange as those movies are, I loved them and loved watching them with you. Thanks for getting us pumpkins so I could carve my first pumpkin, I hope our foxy isn’t rotting away too quickly out there. Next Halloween I know we will carve/ paint even better pumpkins. Thanks for putting up that Christmas tree with me, it’s an honor to have our first tree sit in your living room while we are apart. Thanks for drawing on my arms, your beautiful art marking my skin of our characters makes me so happy. I’m still in awe at your character design of my boy. Thanks for paying for Wendy’s, and shopping for food while thinking of me like the barbecue chicken pizza. Thanks for being open to watching that church message on salvation, even though it was a long one. It’s an important matter to me. Thanks for the most comfortable bed in the world to sleep in, with the most cuddly partner I could dream of, for the hundreds of hugs and kisses shared between us and the parts we can’t text about in here. Thanks for the bath and showers. Thanks for the trip to six flags, paying for my ticket and making for such a memorable night. Thanks for the ride back to the airport and paying for all the gas money. Thanks for all the small moments I couldn’t capture in this text, they all matter to me dearly. Most importantly thanks for choosing to love me across the country, with such passion and thoughtfulness in every little thing. It’s not easy being away from your lover, especially when we know we are going to have to do it for such a long time. I promise to choose to love you until the end, through everything. I am lucky to have you, I appreciate you more than I could ever express. I love you so so much, and every mile this plane travels away from you it burdens my heart. We are strong, and God is with us every step of the way. I can’t wait for our future.",
            "date": "November 4"
        },
        {
            "author": "Holleigh",
            "text": "My love, you don’t have to thank me at all. It’s an honor to get to love you and plan all these things for you and us🩵 Thank YOU for choosing me, all the way from Alabama and making the trips out here to spend time with me. It’s wild to think that someone from across the country could care about me and love me so much to take a plane and visit me. You are a testament of Gods love and a reminder of it every single day. The fruits of the spirit flourish out of you daily. I loved getting to spend time with you this weekend. I really appreciate you dressing up on Halloween and going with me to my sisterhood event, that meant the absolute world to me! I loved getting to go to six flags with you aswell, I’m so lucky to love you and be loved by you Zac. Every second and moment this weekend with you was a true dream. I treasured watching the wild robot, and all the other fun movies we got to! I’m so glad you like to watch movies like that with me, you compliment me in so many ways🩵 Zac you are everything and more I’ve prayed for since I was little, I knew the moment you reached out to me that you were going to be permanent and someone really special in my life. God knew my heart needed you. He placed you into my life at the most perfect time, I wasn’t even looking when you came into my life. You truly are a gift from the lord Zac. I’ll spend the rest of my life trying to show you how much I love you and appreciate you in every way. I cannot wait for our future together, to marry you, make a life with you and see where the Lord takes us. Long distance is hard, but I know it’s all going to be worth it in the long run. We’re fortunate to be able to see each other just about every month, I treasure my time with you even more because it’s limited. I take for granted time with friends all the time because I get to see them 24/7, but God has taught me that time with the ones you love is to treasure and to not take it for granted. I love you Zac, I miss you so much. Thank you for giving me your sweatshirt, it’s like you’re hugging me🥰 I love you always and forever my love.  I can’t wait to marry you, take your last name and see what our future holds. This is just the beginning of our adventure💙 I love you always, we have forever to go",
            "date": "November 4"
        },
        {
            "author": "Zac",
            "text": "Your spirit reminds me of a river’s calm, never-ending flow my love. It’s nurturing, life giving, and steady. Just as a river flows gracefully, shaping the landscape with its gentle persistence through erosion, your presence fills my life with peace and strength. Your beauty isn’t just what the world sees, it’s in the way you bring calmness and joy to those who are lucky enough to be near you. When someone gets to know you, it’s hard to not just want to hang by the river that is your soul and be nourished. I’m blessed enough to be able to be by that river permanently, and even looking upon you from a distance is satisfying enough, but the thought of being able to close that distance exhilarates me. My love for you flows as naturally as a river’s path, steady and unwavering, and it only grows deeper with each day you bring your gentle strength and beauty into my life 🏞️",
            "date": "November 11"
        },
        {
            "author": "Zac",
            "text": "Goodnight my lover. My beautiful, lush garden. Your vibrant life many experience but few get to hold it so close. Your tender, nurturing spirit isn’t just showcased in the beauty of your smile, but the warmth of your love which you offer so naturally, as a garden nourishes all around it. I apologize for forgetting you’ve got to wake up early tomorrow, I would have said goodnight sooner haha. I appreciate you truly. You give and return love to me so much that I feel like an endless oasis of love waiting to be given to you. It’s a blessing to walk our journey together, not only on this world, but our journey to the next world in Christ. I hope this message finds you well in the morning. Go ahead and give me a call before you have company in your presence, I’d love nothing more than to wake up to your smile first thing in the morning, it’s like the sweet sound of the birds chirping in the morning. I hold onto the hope that I’ll be reunited with my lover soon enough. Thank you for choosing me, I’d choose you in any universe and time.",
            "date": "November 15"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin🩵 this was so sweet to wake up to this morning, and I’m so happy I got to call you before the game💙💙 I hope you’re sleeping well and getting rest !! You are everything and more I’ve ever prayed for. God truly knew what He was doing when he place you into my life. You are the epitome of 1 Corinthians 13:4-8. You show love so well and Godly. You have pushed me towards God and helped strengthen and encourage my relationship with the Lord. I am so proud of you and everything you’re doing and accomplishing! From juggling college, hockey, your internship and still finding time to talk and spend time with me has truly meant the world to me. I never know if find someone who was so intentional with their time and truly wanted to put aside that time to talk and be with me. I love you so so much!🩵 I hope today is the best day!!!",
            "date": "November 15"
        },
        {
            "author": "Holleigh",
            "text": "G’Mornin my love!!🩵 happy Monday!!! I hope you are sleeping well and are getting rest! I loved getting to hang with you yesterday and last night!! I’m truly super blessed to call you mine. You are so loving, caring, kind, generous, thoughtful, intentional and just all around the absolute BEST🤍 Zac you are a blessing in every way. You have been so loving and patient with me as I experience this relationship and this love for the first time. In my moments of weakness you give me a hand to help me up. You’ve been my rock, my confidant and my bestest friend. You’ve shown me a love like no other, one I didn’t know existed. I had given up on finding a Godly love after searching so long, but it was once I stopped looking that the Lord deemed we were ready and led us to cross paths. Meeting you was the BEST thing this year. You have stayed your authentic self and haven’t tried to be different or act different, you are truthful and authentic. You are the sun in my days, radiant and bright. The sun can get into the small crevices in any sidewalk, and cast out any and every darkness. You have been my light throughout this year, a beacon of joy and love not only for me but for everyone you encounter. I love you so much, and I will forever thank God for seeing me fit to give you to me to call my partner, lover and bestfriend. You are the one I know God blessed me with to spend the rest of my life with. I love you Zac, always and forever 🩵🩵 you are my answered prayer in EVERY way",
            "date": "November 18"
        },
        {
            "author": "Zac",
            "text": "Thank you so much for the lovely message to wake up to my love 💙 It means so incredibly much that you would put in the effort to type it out. Ever since meeting you I’ve been touched by the effort and love you’ve shown me. Despite being 1700 miles from you, you consistently show God’s love in my life, something I’ve been lacking from others. Thank you so much, you’ve restored hope with your care, patience, and kindness. I’ll cherish you until the end of time. Have a wonderful start to your week today, I hope you’ve gotten the rest you need to succeed. I love you more than anything my love 💙",
            "date": "November 18"
        }
    ]
}